[
    {
        "club": "Artistic Swimming",
        "description": "Welcome to Artistic Swimming! Previously known as synchronized swimming, this sport is a combination of dance, swimming, and gymnastics. We welcome both seasoned swimmers and those new to the sport, no experience required! Come to our try-it practices at the beginning of the term and stay to learn a routine and compete with us across the country. Reach out to us on instagram or email us at artisticswimming@uwaterloo.ca. We hope to see you in the pool!",
        "try_it_sessions": "Date Location Time\nSeptember 15    Studio 4\nPool 6-7 PM\n7-9 PM\nSeptember 17   Studio 3\nPool \n  7-8 PM\n8-10 PM\n  September 19  Studio 4\nPool 8-9 PM\n9-10 PM\nSeptember 22 Studio 4\nPool 6-7 PM\n7-9 PM",
        "fee": "Approximately $170.00 per player. This fee is for each semester.",
        "contact": "mailto: artisticswimming@uwaterloo.ca"
    },
    {
        "club": "Dragon Boat",
        "description": "Hey Warriors! This term, dragon boat practices are going be 2 dryland practices (in CIF and PAC Warrior Zone) and 1 pool practice in PAC. We welcome people of all skill ranges! If you have any questions or concerns, please reach out to us at info@uwdbc.com! We hope to see you all there! Paddles Up!\nVisit Dragon Boat Club Web Page to learn more and register!",
        "try_it_sessions": "Date Location\nSeptember 15    Laurel Creek",
        "fee": "Approximately $36.75 per player. This fee is per semester.",
        "contact": "mailto: info@uwdbc.com"
    },
    {
        "club": "Lifesaving",
        "description": "\"Welcome to the Lifesaving Sport club based at the University of Waterloo. Everyone is welcome!\nJoin in and practice and compete in Lifesaving Sport. Members practice and compete in three disciplines – Lifeguarding (Water Rescue, First Aid and Priority Assessment), Pool Lifesaving (sport based on the lifeguarding skills), and Surf/Waterfront Lifesaving (paddle boards, surf skis, surf swim, beach flags, beach sprint, etc). Club members successfully compete regionally, provincially and nationally and even internationally, throughout the year and are four-time 2014 Champions. Members can choose which discipline to “play” in and when and if to compete. Lifesaving Sport is an official Commonwealth and World Games event and is recognized as a competitive sport by the IOC. Come out and show your stuff! All lifeguards/future lifeguards and swimmers are welcome to attend practices.\"\n ",
        "try_it_sessions": "Date Location Time\nSeptember 16, PAC Pool 8-9 PM\nSeptember 18 PAC Pool 8-9:30 PM\nSeptember 21 PAC Pool 4-5:30 PM\nSeptember 23 PAC Pool 8-9 PM\nSeptember 25 PAC Pool 8-9:30 PM\nSeptember 28 PAC Pool 4-5:30 PM",
        "fee": "Approximately $63.00 per player. This fee is per semester.",
        "contact": "mailto: lifesaving@uwaterloo.ca"
    },
    {
        "club": "Triathlon",
        "description": "The Warriors Triathlon Club is open to University of Waterloo students, staff, faculty, and members of the UW community at large who have memberships at the University of Waterloo’s Athletics Department. The club will create a group training environment in which athletes of a wide range of ability levels can improve. In addition, our group training sessions will build a community of athletes, in which individuals may establish friendships and training partnerships that continue outside of club programming",
        "try_it_sessions": "Date Location Time\nSeptember 15 PAC Pool 4-5:30 PM\nSeptember 17 Spin Studio 6-7:30 PM",
        "fee": "Cycling membership - $10.50",
        "contact": "mailto: triclub@uwaterloo.ca"
    },
    {
        "club": "Underwater Hockey",
        "description": "Underwater Hockey is a co-ed, student-run club that aims to introduce students to the sport of Underwater Hockey. It is a sport that combines swimming, diving, and hockey skills in a pool. The players wear masks, snorkels, fins, and protective gloves while playing with a weighted puck. The sport is non-contact and requires speed, stamina, and strategy.",
        "try_it_sessions": "Date Location Time\nSeptember 16 PAC Pool 9-10 PM\nSeptember 20 PAC Pool 9-10 PM\nSeptember 23 PAC Pool 9-10 PM\nSeptember 27 PAC Pool 9-10 PM"
    }
]