[
    {
        "names": "A Cappella Club",
        "overviews": "The UW A Cappella Club is the umbrella club of all a cappella groups at the University of Waterloo! UWACC was founded in 2008 originally with one ensemble and has since expanded to include many different groups including the AcaBellas, the Unaccompanied Minors, ACE, the Musical InterDudes, the Water Boys, and In Full Colour. The Water Boys\nThe Water Boys is a lower-voice auditioned group.\n: \n: \n: \n: @waterboysuw\n: @WaterBoysUWThe Unaccompanied Minors\nThe Unaccompanied Minors is a mixed-voice auditioned group.\n: \n: \n: \n: @uw.unaccompaniedminors\n: @MinorsACappellaThe AcaBellas\nThe AcaBellas is an upper-voice auditioned group.\n: \n: \n: \n: @uwacabellas\n: @TheAcaBellasACE\nA Cappella Ensemble (ACE) is a mixed non-auditioned group.\n: \n: \n: \n: @uw_aceThe Musical InterDudes\nThe Musical InterDudes is a small mixed-voice auditioned group focused on musical comedy.\n: \n: \n: \n: @themusicalinterdudesIn Full Colour\nIn Full Colour is a mixed-voice auditioned competitive small group focused on storytelling.\n: \n: \n: \n: @infullcolouracappellaTypically, auditions are held at the start of term. During the term, social events are held as well as workshops run by club members and professional musicians. The term ends off with the End of Term (EOT) concert held at one of the theatres on campus. Groups typically practice 1-2 times a week and learn around a 10-15 minute choreographed set for the EOT concerts. Outside of the EOT concerts, there are numerous performance opportunities on campus and within the KW area where the groups get to interact with the community at large.For further details on JOINING or PERFORMANCE REQUESTS, please email the groups directly, or email . We look forward to singing with you!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [
                "http://www.youtube.com/waterboysacappella",
                "http://www.youtube.com/user/UnaccompaniedMinorUW",
                "http://www.youtube.com/theacabellas",
                "http://www.youtube.com/uwacappellaensemble",
                "https://www.youtube.com/channel/UClxfv2PBjdj8abGQEiKEeVQ",
                "https://www.youtube.com/channel/UC3T71M7qnoYXBARldcOgVyQ",
                "http://www.youtube.com/user/uwacappellaensemble"
            ],
            "Facebook": [
                "https://www.facebook.com/waterboysuw/",
                "https://www.facebook.com/minorsacappella",
                "https://www.facebook.com/UWacabellas/",
                "https://www.facebook.com/uwaterlooace/",
                "https://www.facebook.com/TheMusicalInterDudes/",
                "https://www.facebook.com/infullcolouracappella",
                "http://www.facebook.com/UWACC"
            ],
            "Instagram": [
                "https://instagram.com/uwacc"
            ],
            "Twitter": [],
            "Website": [
                "uwacc.com"
            ],
            "Email": [
                "waterboys.acappella@gmail.com",
                "uw.unaccompanied.minors@gmail.com",
                "the.acabellas@gmail.com",
                "uwaterlooace@gmail.com",
                "MusicalInterdudes@gmail.com",
                "uw.infullcolour@gmail.com",
                "uw.a.cappella.club@gmail.com",
                "uw.a.cappella.club@gmail.com"
            ]
        }
    },
    {
        "names": "ACE - A Cappella Affiliate",
        "overviews": "ACE is a mixed-voice, open a cappella group in the UW A Cappella Club running both in Waterloo and online remotely! We accept all members of all levels of musical experience. We provide musical development workshops and guide members through learning how to sing in an a cappella group, culminating in several gigs and online song productions at the end of each term! Find out more by visiting our  (@uw_ace) and joining our discord server (DM us on instagram for the link)!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "AIESEC",
        "overviews": "We promote leadership development and global impact through promoting and facilitating international volunteer and internship exchanges. We have a membership dedicated to helping interested students apply and get accepted for opportunities abroad. We have a strong focus and alignment with the UN Sustainable Development goals.",
        "membership_type": "\nTo have access to our databases and membership on salesforce.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "African Student Association (ASA)",
        "overviews": "We are a group of students of African origin who hope to promote African culture and interaction. Membership is open to all students who wish to interact with African students and learn and experience our rich and diverse cultures. We also provide an environment for students to socialize and air their views on Africa. Africa is a very diverse continent with some countries consisting of more than 50 tribes! We have representatives from all regions of Africa giving us a broad background within the club. We organize a number of events where people can experience the warmth of the African sun and learn more about our continent. Please check our social media accounts for upcoming events or send us an email with any comments or questions at .",
        "membership_type": "\nenabling members to get discounts on paid events and on club swag. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uow.asa@gmail.com"
            ]
        }
    },
    {
        "names": "AfroXDance Club",
        "overviews": "The Afro-Fusion dance club  is aimed at bridging the gap between cultural and traditional African dance styles and other genres of dance; hip-hop, contemporary, jazz, salsa, etc. The club will serve as a creative space for dancers from all backgrounds who wish to learn more about African dance styles and connect with their African dance roots. Each class promises to be filled with fun and learning in addition to being a great total body workout!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Amnesty International",
        "overviews": "Amnesty International is a non-profit organization that operates worldwide with over 8 million members around the world. This club will advocate for the protection of individuals and is focused on the promotion of human rights. UW’s amnesty international chapter strives to provide awareness to students, faculty, and alumni about the human rights violations that occur globally. By being a member, you would actively be working to take a stand against the abuse to one's freedom.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Animal Rights Society",
        "overviews": "We discuss animal rights related topics, advocate for animal rights on campus and in the Waterloo community and meet like-minded people. We run events such as vegan bake sales, fur-free pledges, vegan cooking classes, farm sanctuary trip, coffee giveaway, farmers market trip, weekly meetings, halloween candy giveaways, activism panel, vegan cheese giveaway, cruelty free booth, and any related events. Initiatives would include advocating for more vegan options on campus through the UW Food Services survey.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Animusic Ensembles",
        "overviews": "Animusic Ensembles is a group of musicians dedicated to playing music originating from primarily anime and video game soundtracks. Our ensemble accepts all instrumentalists. Arrangements are created by members and performed by groups of varying size and instrumentation.For additional information, feel free to email",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uw.animusic@gmail.com"
            ]
        }
    },
    {
        "names": "Armenian Students' Association",
        "overviews": "The Armenian Students’ Association at the University of Waterloo wishes to bring together Armenian students, as well as students interested in Armenia/Armenian culture, and create a sense of community. Our goal is to platform and showcase Armenian history, current events, culture, art, and language, through fun and educational events.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Ascend Canada Waterloo Chapter",
        "overviews": "Ascend was started to address the shortage of Asian leaders in Corporate America and broadened its horizons to Canada in 2012, with a mission to be the premier professional organization dedicated to enabling its members, business partners and the community to leverage the leadership and global business potential of Pan-Asians.With the support of 18 corporate sponsors such as TD, Deloitte, Manulife, Ascend looks to develop pan-Asian leadership potential across North America starting with when members are in school to provide career long relevance. Ascend will help set students up for long-term career success through mentoring and guidance, offering a platform to build connections with senior leaders across multiple industries and functions. Membership spans across various industries and multi-national companies and is open to individuals of all ethnic and business backgrounds.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Association of Caribbean Students",
        "overviews": "The Association of Caribbean Students (ACS) at the University of Waterloo is a social club that is dedicated to the promotion of Caribbean culture and cultural unity in general within the University Community. Within ACS, students born in the Caribbean will be able to experience and enjoy an atmosphere in which they can relax and feel at home. Students not born in the Caribbean, but with Caribbean background will find a place where they can find out more about their ancestry, homeland and culture. Students with no Caribbean background will have the opportunity to discover more about a unique culture and participate in activities and events that they might not have otherwise been able to experience. The ACS provides entertainment and educational value to students of all backgrounds.",
        "membership_type": "\nSection 3 \nAll students registered at the University of Waterloo shall be eligible for membership, and shall \nbe granted that status upon payment of the standard membership fee. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Association of Korean Canadian Scientists and Engineers",
        "overviews": "AKCSE is a non-profit organization to support sharing scientific knowledge between Korean-Canadians and setting up connections between Korea and Canada for further development. Our organization promote the application of science and technology for the general welfare of society, help KoreanCanadian scientists and engineers develop their full career potential in both Canada and Korea, and serve the Korean community by delivering scientific and technological information. Although the target audience is focused around scientists and engineers, individuals of any faculty are welcome to join, as we hold academic and social events aimed to benefit all of the student body at the University of Waterloo.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Aviation Society",
        "overviews": "The University of Waterloo Aviation Society aims to represent and provide opportunities for University of Waterloo Aviation Students, as well as foster a community for those interested in Aviation.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Best Buddies, UW",
        "overviews": "Best Buddies was founded in the United States in 1993 and has expanded worldwide. As a participating school, the University of Waterloo Best Buddies Chapter's goal is to make our community more inclusive and accepting of people with intellectual disabilities.The club consists of Peer Buddies and Executive members. Peer Buddies are students paired in a one-to-one friendship with an adult who has an intellectual disability (called a Buddy). Peer Buddy and Buddy matches are made for at least one academic year and made based off similar interests between the pair. Executive members consist of a President, Vice President, Treasurer, and Junior Executives. Peer Buddies and Buddies meet and connect virtually or in-person once a week. At this time, our Chapter holds group events once a month, either in-person or virtually.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Big Spoon Lil Spoon",
        "overviews": "Big Spoon Lil Spoon (BSLS) was founded at Queen’s University and aims to provide mentorship to children with exceptionalities. BSLS pairs up children with student mentors throughout the year. The unique program features cooking classes, life-skill workshops and employment programs for children with special needs. BSLS members will be able to form their own subcommittees to carry out personalized projects that aim to support children with exceptionalities.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Black Association for Student Expression,UW (UW BASE)",
        "overviews": "UW BASE stands for the University of Waterloo Black Association for Student Expression. We seek to provide students with an establishment that offers peer mentorship and community outreach initiatives; promote diversity, cultural enlightenment and a heightened understanding of black people and black culture; act as a medium for students to express themselves and to foster a stronger identity within the university demographic; welcome, respect, love and appreciate people of all colours, backgrounds and mixes thereofWe host events such as Fever: Annual All Ages Throwback, the \"One Seed. Many Roots,\" Black History Month Series, Afro Day, A.C.E with BASE Networking event, Grill and Chill and numerous other educational and social events.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Black Medical Leaders of Tomorrow",
        "overviews": "The University of Waterloo Black Medical Leaders of Tomorrow (UW BMLT) aims to encourage and assist BIPOC students, and those at a socio-economic disadvantage in their pursuit of medical school or healthcare professions. We want to increase the representation of racialized populations in the healthcare field and we strive to support UW students through our events and resources.",
        "membership_type": "\nThe purpose of the fee is to fund activities/events that will be held for members covering food/drink costs, supplies, etc.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Breakers,UW",
        "overviews": "The UW Breakers promotes hip hop culture and break dancing as a fun and exciting activity for students and others as a form of self-expression and as an opportunity to get to know one another. The club mainly hosts a weekly open practice that is open to all levels of dancers to learn and practice breaking. Occasionally, UW Breakers will host a dance battle for members who are interested in competition and this part of breaking culture.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Buddha's Light Community Club, UW",
        "overviews": "1. To encourage the understanding of Buddhism, particularly Mahayana Buddhism and Humanistic Buddhism and to promote the application of the Buddhist principles of kindness, compassion, joy, and equanimity to our daily lives. \n2. To organize meetings and social gatherings to discuss Buddhism-related topics. \n3. To provide a friendly environment for spiritual development to the members of the University who are interested in learning Buddhism and meeting with other Buddhists. \n4. To provide an opportunity for students to improve their skills on event organization, leadership, newsletter publishing, and website development.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Campus Association for Baháʼí Studies at UW (CABS)",
        "overviews": "Campus Association for Baha'i Studies (CABS) is the UWaterloo club associated with the Baha'i Faith, a religion founded by Baha'u'llah whose central purpose is to establish the oneness of humanity.The purpose of CABS is to gather friends of all backgrounds to deepen on the teachings of God and the history and philosophy of the Baha'i Faith; as university students, to learn how to be of service to humanity in all the different aspects of our lives.Examples of events we hold are devotionals and study sessions. Devotional gatherings consist of reading prayers and passages from religious texts in an informal and reverent atmosphere followed by thoughtful discussion. Study sessions are more structured spaces to explore the Baha'i perspective on varying subjects. They involve research, lively consultation and an open mind in order to redefine our understanding of our material and spiritual realities.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Campus Compost, UW",
        "overviews": "UW Campus Compost (UWCC) is a student-run club that collects organic materials from across campus through our composting program and processes it into compost for the community. We also advocate for waste reduction and other sustainable practices through social media, workshops, and volunteer events.Why did we start?\nUW Campus Compost was established in 2014 to bring compost bins to campus back when the University did not have an organic waste collection system. Before its establishment, much of the groundwork started in 2012 under the \"University of Waterloo Compost Coalition\", lead by a team of Environment students. Since then, the University has started its own organic waste program which makes organics disposal even more convenient on campus. While we still conduct our compost operations, we have expanded our mission to include advocacy around sustainability through campaigns and events.Find us on our socials:\n: @uwcampuscompost\n: @UWCampusCompost\nWebsite: \nBlog: \nLinkedIn:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://uwcampuscompost.wixsite.com/uwcc",
                "https://uwcampuscompost.medium.com/",
                "https://www.linkedin.com/company/university-of-waterloo-campus-compost/"
            ],
            "Email": []
        }
    },
    {
        "names": "Campus Crusade for Cheese",
        "overviews": "Weekly meetings: Tuesdays, 6:00 - 6:45 pm. Location TBD!The purpose of the CCCh is to offer an outlet for students, faculty, staff, and Alumni who enjoy cheese or wish to enjoy cheese. We have activities such as eating cheese, talking about cheese, rating cheese, cheese related news, current cheese events, and more. Cheese plates may include other things aside from cheese such as crackers and meats.Follow us on  @uwcheeseclub or email us at .",
        "membership_type": "\nFull Membership\n- Voting member\n- Cheese and snacks are provided at meetings\n- Membership card (including Vincenzos)\n- Reduced prices for events\n- Are eligible to be on the Executive Committee\n\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "ccch.uw@gmail.com"
            ]
        }
    },
    {
        "names": "CariVybz Dance Company",
        "overviews": "The CariVybz Dance Company is a Caribbean Dance Club seeking to gather University of Waterloo students, staff, faculty, and members of the UWaterloo community to celebrate, cultivate, express and share the beautiful dance culture.",
        "membership_type": "\nThe non-refundable membership fee is $5 cash per term payable to the Treasurer no later than one month after the first day of class. If joining after the first month, membership is due at the beginning of their first club function.  Membership fees will be used to:\n- Finance costumes\n- Finance speaker\n- Transportation for outside events\n- Fundraisers\n- Club Socials\n- Club Parties\n- Any merchandise; including but not limited to shirts, laptop stickers, etc\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Chess Club, UW",
        "overviews": "Welcome to another great term at UW Chess Club. We wish to provide an environment where people throughout the Kitchener-Waterloo Region can enjoy the game and share their love for chess through discussions and strong tournaments for all levels. We provide a mentorship program for beginners who are intent on getting better as well as casual play with your friends and teachers.We are pleased to inform that we have established Kitchener-Waterloo Chess Club as our co-sponsor.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Chinese Christian Fellowship, UW",
        "overviews": "The Chinese Christian Fellowship (CCF) is a campus group of culturally diverse Christians who meet together regularly to: be a visible and effective witness for Jesus Christ on this campus, provide an environment of mutual support that will enable students to discover their potential and the true meaning of life within the context of university as well as after graduation, encourage its members to practice genuine Christian love, and help students integrate into local churches.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Chinese Hip-Hop(Rap) Club",
        "overviews": "Chinese Hip-Hop Club provides a platform for students who are interested to communicate and make music together, no matter how skilled are you in that, as long \nas you are interested in this, come and join us!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Chinese Students Association (CSA), UW",
        "overviews": "The University of Waterloo Chinese Students’ Association (UWCSA) was established in 1974 with a vision of bringing awareness to the Chinese culture and community. After its establishment, UWCSA has expanded to serve hundreds of members. Being the largest Chinese cultural club at the University of Waterloo, we aim to connect and unite the diverse Chinese students at our institution, and in the process, contribute to multiculturalism throughout our university.UWCSA is widely renowned for its planning and execution of multiple successful events and activities each term. We host a variety of events, such as contests, outdoors events, and social nights to facilitate and foster communication between our members and the general student body. We also organize joint events with other clubs (including those outside of the University of Waterloo) to extend our culture to others.In the future, the members of UWCSA are hoping to grow with one another, creating an organization that is successful and beneficial to all students at the University of Waterloo.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [
                "https://www.facebook.com/UWaterlooCSA"
            ],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://linktr.ee/uwcsa",
                "https://www.tiktok.com/@uwaterloocsa",
                "https://discord.com/invite/U4AkBZRPvZ"
            ],
            "Email": []
        }
    },
    {
        "names": "Christian Orthodox Campus-Ministry Association",
        "overviews": "OCF is charged with connecting Orthodox college students—and those interested in the Orthodox Christian faith—to Christ and His Church. OCF realizes this mission by:- Supporting members' experience and witness to the Orthodox Christian Church through community life, prayer, service to others, and study of the Faith- Providing a variety of thoughtful and innovative programming including College Conference and Real Break domestic and international service projects",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Christians on Campus",
        "overviews": "Christians on Campus (CoC) are believers in Christ. Thus, we love the Lord Jesus Christ and endeavor to give Him \"the first place in all things\" (Col. 1:18). Whether meeting one-on-one or in small groups, our desire is to cooperate with Him for the accomplishment of God's eternal purpose (Eph. 3:11) by ministering the unsearchable riches of Christ (Eph. 3:8) for the building up of the Body of Christ (Eph. 4:12). We warmly receive all believers in Christ, and people who want to learn about Christ and we seek to maintain the oneness of the Spirit by keeping our focus on Christ. He is so rich! He is so full! He is everything to us, and He is the center of our enjoyment. Christians on Campus is a registered Federation of Students club at the University of Waterloo. We hold the faith that is common to all believers. Through daily prayer, Bible reading, and Christian fellowship we are growing \"in the grace and knowledge of our Lord and Savior Jesus Christ\" (2 Pet. 3:18). To Him be the glory both now and forever. Amen. For further information, including our weekly gatherings such as our Bible study, please contact us or visit our website.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Club That Really Likes Anime (CTRL-A)",
        "overviews": "CTRL-A is a social club that promotes interest in animation, predominantly of Japanese origin. Our club of 30+ years is open to anyone with an interest in anime, gaming, and any other related topics. We hold on-campus events, with general meetings traditionally held once a week, anime screenings several times a term, in addition to other special events, such as karaoke and conventions.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Concert Band, UW",
        "overviews": "UW Concert Band Club is a club for people who loved those concert band days in high school, or even elementary school! Our unauditioned concert band presents an opportunity for musicians from all faculties and programs to maintain their musical skills while having fun in a supportive atmosphere.\nWe practice weekly in DC 1350 or 1351, check out our site below for more information about the current term or email us to get in the know!linktr.ee/uwcbc",
        "membership_type": "\nSection 5.1 - Membership Fees\nThe membership fee is $15 paid directly to the club. The membership fee must be paid by the second-last general meeting. Under special conditions, the fee may be waived with majority approval of the Executive Members. Members may require uniforms and attire for public performances; these costs are not covered by the membership fee and will require the payment of an additional fee beyond membership. Members will be given at least one month's notification of these charges. While uniform costs do not need to be paid to attain or retain membership with the club, they may be mandatory to partake in public performances. Members electing not to pay uniform costs must inform the executive within the first month of their membership, will be provided a shirt for the duration of the concert, to be returned immediately afterwards.\nMembership fees will be used and budgeted each term for:\n1.\tSheet Music and Other Copyright Expenses (see Section 5.2)\n2.\tRental/Purchase of Percussion Instruments (see Section 5.3)\n3.\tRental Subsidies for Instruments (see Section 5.4)\n4.\tAdministration Fees (see Section 5.5)\n5.\tMembership Appreciation Expenses (see Section 5.6)\n6.\tOther Expenses (see Section 5.7)\nSection 5.2 - Sheet Music and Other Copyright Expenses\nTo ensure a variety of music from term to term, new sheet music can be purchased each term. Sheet music purchases are the responsibility of the Conductor(s) for the term. The Conductor(s) may only purchase sheet music that is intended to be played during the Conductor(s)'s term.\nSince most concert band repertoire is not public domain, the club may use the membership fees to cover any appropriate copyright costs required to use the music.\nSection 5.3 - Rental/Purchase of Percussion Instruments\nPercussion instrument rentals may make up the largest expense funded by membership fees. It is a reasonable expense since concert bands percussionists are not expected to own their own instruments (due to their price and size). Also, percussion instruments are fundamental to concert bands and benefit every member and the band as a whole.\nAdditional funds will be budgeted for the purchase of percussion instruments, or put into savings for purchases in future terms. Purchases will be approved by a majority vote of current Executive Members on a per term basis.\nSection 5.4 - Rental Subsidies for Instruments\nDepending on the balance of the band for the term, the requirements of the music being played, and the costs associated with renting an instrument, the club may offer a small subsidy to partially cover the cost of the rental. The value of the rental will depend on the instrument being rented, but it will not exceed the value one month of rental of the instrument from an official company (rental subsidies will not cover Warriors Band rentals).\nTo apply for a rental subsidy, members must submit a request to the club. Requests may not be made before the club's first general meeting of the term. The rental subsidy request requires approval of both the Primary Conductor and the majority of the Club Executives. Requests are to be processed within term of submission. All approved requests are conditional on the applicant being an active member of the club and not missing more than two general meetings, without approval of extenuating circumstances by the Club Executives. The applicant is responsible for arranging the rental and providing the club with receipts as proof of the rental. If the approved request meets all of the necessary conditions, the subsidy will be paid out at the last general meeting of the term.\nSection 5.5 - Administration Fees\nThere are many administrative expenses associated with running a successful band. These include, but are not limited to:\n1.\tMarketing and advertising expenses\n2.\tInformation technology expenses\n3.\tPhotocopying and printing expenses\n4.\tVenue rental expenses\nSection 5.6 - Membership Appreciation Expenses\nA portion of membership fees will be budgeted for membership appreciation activities including, but not limited to:\n1.\tProviding food and refreshments at concerts and socials\n2.\tProviding memorabilia for participation in a given term.\nSection 5.7 - Other Expenses\nOther expenses will be budgeted as deemed necessary by Executive Officers.\nSection 5.8 - Membership Fee Refund Policy\nUnder no circumstances will membership fees be refunded to members.\nSection 5.9 - Reimbursement Policy\nTo prevent the club from accumulating debt to its members, any expense incurred must be processed at latest one academic term after the term in which the cash expenditure took place.\nSection 5.10 - Active Members\nTo be considered an active member of the band, an individual must have paid their membership fees for the term and attended at least one rehearsal. In the event that membership fees are waived for some or all members, via majority Executive vote (Section 5.1), any such member is considered an active member of the band if they have attended at least one rehearsal.\n\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Contact Lens Interest Club (CLIC)",
        "overviews": "We are a student-run organization with the goal to encourage and promote\ncollaboration in the field of contact lenses between undergraduate optometry students and graduates in vision science at the University of Waterloo School of Optometry and Vision Science. The aim of the club is to expose students to the most up-to-date and common practices in contact lenses. This will be done through providing information on current research papers and clinical practices with journal club workshops to explore and discuss contact lens research, as well as\nguest lectures from experts in the field.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Cooking Club, UW",
        "overviews": "The Cooking Club serves up cooking classes, workshops, bake sales, potlucks, and other food-related adventures. We cover the full spectrum of foods from fancy pasta classes to quick and dirty tips to help you manage the necessary evil known as ‘cooking during midterms’. When we’re not in the kitchen or hosting our famous classes, we occasionally venture out to the real world to visit coffee roasters, picnic areas, strawberry fields, or bonfire pits. If we’re not doing any of the above, our members are usually busy trying to craft an amazing burger or a cupcake to help fuel the culinary debauchery!Join our Discord server and follow our  (@uwcookingclub) to keep up with our events and become apart of the community!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Crafts 4 Charity",
        "overviews": "We are a UW DIY campus club that seeks to spark creativity. Every term we host a couple of workshops teaching you how to make cute plushies, polymer clay charms, and more- we will provide the materials and instructions, all levels are welcome! We often sell our handmade crafts to raise money for various charities, so keep your eyes peeled for us on campus!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Creative Writing Club",
        "overviews": "The Creative Writing Club aims to provide a space for members of the University of Waterloo community to practice and share different forms of creative writing. Throughout the term, we will host writing and peer editing sessions, as well as reading nights where members can share works they are proud of. At the end of each term, we will host an awards night where members of the club can celebrate some of the best works written that term.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Creators Collective",
        "overviews": "The Creators Collective is a club that supports students' creativity at the University of Waterloo! We hold an annual gallery and have a printed magazine showcasing all forms of student art as well as a market that provides a single source to find products and services provided by our own students. Creators Collective hosts events throughout the year that target to establish and create a sense of community between creators.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "CroWat: Croatian Student Association",
        "overviews": "The Croatian Student Association (CroWat) is a place to connect students based on their love of, or interest in, Croatian culture including language, music, dance, academics, and food.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Culture and Language Exchange Club, UW",
        "overviews": "The purpose of this club is to promote the exchange of language and culture between students by forming small study groups. With the multicultural student body of UW, we are able to match up each student's preferred language to learn with other students who are knowledgeable in that language and can teach. This club compliments the academic languages courses nicely, and provide an opportunity to learn languages in a fun manner. Individual sessions will focus on improving the individual's speaking, listening and writing (grammar & spelling) skills through lectures as well as fun activities incorporating students’ hobbies and interests. This also serves as a great opportunity to prepare students who wishes to participate in foreign exchange programs.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "DJ Club, UW",
        "overviews": "UWDJ Club is about bring together the UW DJ community. It is about all forms of DJing. People who DJ, those who want to learn, and those who just like the music. Want to know more? Check out the website, or drop us a line at our e-mail address.Every week the DJ Club is planning to come together to share knowledge and expertise. We hope to bring turntables, mixer, and small PA into the lower atrium to play. The plan is to rotate between hip hop and electronic forms of music allowing various DJs in the UW community to share with one another.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Debate Society, UW (Debating Association)",
        "overviews": "Our purpose is to hone our skills for competitive debate, within the CUSID (Canadian University Society for Intercollegiate Debate) and beyond. We do this through lessons on improving debate and public speaking, attending/hosting intercollegiate debate tournaments, socials and other events.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Deception Board Games Club",
        "overviews": "We love playing deception games such as Avalon, Coup and Battlestar Galactica! Join our  group to vote on when we meet up to play or send us an email with any questions.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Egyptian Student Association",
        "overviews": "Welcome to the Egyptian Student Association at WUSA! A vibrant community for Egyptian students and students with an interest in Egyptian culture, heritage and the rich history of a country with one of the 7 wonders of the world! Whether you're an Egyptian student looking for supportive community and environment or a student intrigued by the fascinating country, our association provides a welcoming space for all. Come be apart of the Egyptian Student Association, uniting us in the spirit of cultural appreciation and friendship. Explore Egypt with us, right here on campus!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Eritrean and Ethiopian Students Association",
        "overviews": "The Eritrean and Ethiopian Students Association aims to provide a space on campus to express the rich cultures of Eritrea and Ethiopia and foster a sense of community. We aim to do so by hosting events such as a cultural showcase, networking events, workshops, and more! This club is open to all students, we encourage you to follow us on  to stay informed on our upcoming events @eesa_uw.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Euchre Club, UW",
        "overviews": "The purpose of our club is to give experienced Euchre players an organized, competitive level of euchre play, while providing new players with a fun environment in which to learn the game of Euchre. We have weekly meetings where you can meet new people, socialize, and enjoy the great game of Euchre.There is a $5 membership fee for joining the UW Euchre Club for a term. This fee covers weekly snacks/drinks and tournament prizes.",
        "membership_type": "\nTo provide the club with snacks, tournament prizes, and resources such as playing cards.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Fashion for Change",
        "overviews": "Fashion for Change is a non-profit organization that unites students at the University of Waterloo, Conestoga College and Wilfrid Laurier University to host the largest student-run charity fashion show in the K-W region. Over the past 10 years as a club, we have raised over $125,000 for charity! With over 130 executives and models yearly, our family is full of passionate students that use our talents to change the world! We use fashion, dance, film, music, and other mediums to promote artistic expression.",
        "membership_type": "\nThe executive membership fee is CAD $25.00 cash, and the model fee is CAD $30 per school year, payable no later than one month after the first day of class. If joining after the first month, membership is due at the beginning of their first club function, or team meeting. All voting members of the club are required to pay membership fees. These fees cover their membership for one school year(September - September) after which the membership expires. Fees are payable to the director of the department the member is hired for. An individual hired as a model as well as in another capacity must pay $30 to the Model Director(s) and inform the other Director of the transaction. An individual hired as an Executive by more than one Director is only required to pay CAD $25 to the Director whose offer of appointment they accepted first. Volunteers are required to pay CAD $25 to be recognized as voting members of Fashion for Change, however may choose to remain as non-voting members and thus not be required to pay the fee.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Fighting Game Club (UWFGC)",
        "overviews": "The University of Waterloo Fighting Game Club caters to Fighting Game players of all kinds! We are a casual to a semi-competitive club that plays a wide variety of Fighting Games including Street Fighter, Tekken, Guilty Gear, Blazblue, UNICLR, and much more!Join our Discord for all the latest information.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Films, UW (Former Films Creator Club)",
        "overviews": "We are the University of Waterloo Film Club, the home to all things film. From film enthusiasts to script writers, cinematographers to editors, our mission is to unite the film community at UWaterloo. Whether you’re new to film or aspiring to work in the industry, we are open to everyone with all levels of interest.We host a variety of activities during our weekly meetings and special events throughout the semester.Film Production Workshops: Our workshops explore the technical side of the film production processes (storyboarding, shot composition, video editing, etc.) and different techniques used in the industry (ex. stop motion animation).Screenings: Sometimes we host film screenings for movies and shows that help introduce a production process or technique for next week’s film production workshop. Snacks will be provided :)Semester Guest Speaker: Get to know someone in the industry! Previous speakers include Curt Lobb, the editor for Blackberry (2023) and Tim Hamilton, the director of many comedic commercials including the infamous House Hippos commercial.Want to get your club event filmed or interested in collaborating with UW Film Club? Shoot us a DM at @uwfilmclub_ or email us at .",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "theuwfcc@gmail.com"
            ]
        }
    },
    {
        "names": "Game Development Club",
        "overviews": "The University of Waterloo Game Development Club (UWGDC) is a club where students can create, test, and discuss games.  We explore many types of games, from tabletop to digital.During weekly meetings, we host talks discussing game design topics ranging from Level Design to Accessibility.  Additionally, we give tutorials for game development tools including Unity, Unreal 4 Engine, and Blender.Want to make a game?  We have a friendly and welcoming space at the Games Institute to work on your project.  Have a game made already, or in progress?  We regularly play-test member-made games during club hours.  Game developers of all skill levels are welcome!For more information, check out our  account: @uwgamedev",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Global Brigades - Business Brigades",
        "overviews": "Global Business Brigades UW, part of the Global Brigades family, is an international movement of university students and professionals building economic opportunities in the developing world. \nWe work alongside promising entrepreneurs and experienced year-round staff to create financial opportunities in remote, rural, and under resourced areas of Panama, Honduras and Ghana.\nGBBUW is the first organization at the University of Waterloo to offer students the opportunity to volunteer abroad to consult businesses and entrepreneurs, develop community-led cooperative banks, and promote financial literacy.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Global Brigades - Medical Brigades",
        "overviews": "Global Brigades is the world’s largest student-led global health and sustainable development organization. Since 2004, Global Brigades has mobilized thousands of university students and professionals through nine skill-based service programs to improve quality of life in under-resourced communities through partner organizations in Honduras, Nicaragua, and Panama.Medical Brigades\n​University of Waterloo Global Medical/Dental Global Brigades (UW GM/DB) is a non-profit club led by dedicated students interested in the fields of medicine, pharmacy, dentistry, and healthcare. This club is comprised of various Executive Members and General Members who volunteer locally and/or abroad to Honduras, Nicaragua, Panama, or Ghana to create sustainable, positive impacts on under-resourced communities, while undergoing a life-changing experience. Locally, we organize information sessions, fundraising events, collect hygiene supplies, and recruit brigaders. Then we travel abroad to help run mobile pharmacy/medical/dental clinics in under-resourced communities. Our mission is to empower under-resourced communities as well as the brigaders to resolve global health and economic disparities.",
        "membership_type": "\n1) Materials for Club Meetings i.e. Workshops (major contribution)\n2) Refreshments/Snacks at Club Events (major contribution)\n3) Helps funds capital for Fundraising products (minor contribution)\n\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Gujarati Students Association (GSA)",
        "overviews": "The University of Waterloo’s Gujarati Student Association (GSA) is a club that aims to foster a community to curate cultural expression for the Waterloo body. This club intends to make Waterloo faculty members and students feel connected with each other through their ethnic groups. We want to promote Gujarati culture by organizing a variety of cultural events, workshops, and activities. This club aims to create a safe environment where everyone can feel comfortable and respected through enjoyment and interactions with others. \nYou can get in touch with us by emailing  or messaging on our  page: @uw.gsa.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "gsauwaterloo@gmail.com"
            ]
        }
    },
    {
        "names": "HOSA UW",
        "overviews": "•\tHOSA is an opportunity for undergraduate students to explore different health professions along with gaining personal experience and knowledge to be used in future health settings or even in day-to-day activities such as networking, and leadership.\n•\tHOSA U is an organization of which branches out to several different universities (Western U, McMaster U, UofT, U of Guelph etc.) and the different branches meet annually at the SLC- Student Leadership Conference (March) to compete in a wide range of health science related topics such as EMT, Dental Science, pathophysiology, medical math, pharmacology, HOSA Bowl, Vet science, sports med, biomed lab science, medical terminology, and medical law & ethics. Members can choose which sub topic they’d like to be in and train for that specific event. The university that wins would then compete internationally against other schools in the USA and be eligible for various prizes such as scholarships, or internships.",
        "membership_type": "\nHOSA UW includes a wide-variety of competitions such as knowledge-based competitions, teamwork competitions, and practical events. Some of the practical events include various activities run by a variety of healthcare professionals. These include EMT scene stimulations (performing CPR, wrapping fractures, etc.), nursing stimulations (finding vitals), dental stimulations (using dental equipment, given a patient's condition) and biomedical science laboratory skills (using microscopes, piping, etc.).  All of these competitions require equipment needed in order to practice effectively. Therefore, the $5 will go towards providing for our own branch to fund equipment. This will be done through purchasing equipment through HOSA Canada. Without the access to equipment, members of the club will not be able to fully experience the different healthcare professionals. Some of the equipment needed is labeled below:\n- Stethoscopes\n- BP cuffs\n- Triangular and gauze bandages\n- Mock defibrillator\n- Microscope\n- CPR dummies\n- Dental supplies (mouth mirrors, dental probes, dental forceps etc.)\nWe also hope to provide Professional school tours with the team, such as visiting medical, pharmacy, optometry, dental, and physiotherapy schools. This will require transportation of some sort, so we can allocate the money that is left over after purchasing equipment along with hosting fundraisers to save enough money for transportation.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "HanVoice Waterloo",
        "overviews": "HanVoice Canada is the largest Canadian non-profit organization focused on advancing the North Korean human rights cause by working with leading politicians and policy experts to promote the human rights agenda into legislation and political action. \nAt HanVoice Waterloo, we seek to give a voice to the voiceless with on-the-ground advocacy efforts on behalf of the North Korean people, who remain voiceless and oppressed in the face of insurmountable odds. Whether inside, outside, or in transit from North Korea, we support the North Korean people in whatever way we can.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Her Campus Waterloo",
        "overviews": "Her Campus Waterloo is a chapter of Her Campus which \"is the #1 media site for college women, written entirely by the world’s top college journalists.\". We are an online magazine targeted towards female collegiates written by college journalists focused on a variety of topics ranging from entertainment, culture, food, sex and relationships, fashion, etc.! About Her Campus:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://www.hercampus.com/about-us"
            ],
            "Email": []
        }
    },
    {
        "names": "Hera.co",
        "overviews": "We are a non-profit organization that aims to build a female supporting female community founded in 2021. We realize the importance of peer support and community bond for each individual’s road to success. That’s why we are founded here to support our future aspiring leaders. Our mission is to empower young women to grow the ambition, bravery, confidence, and self-leadership to pursue their passion.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Hillel Waterloo",
        "overviews": "Hillel Waterloo strives to inspire every Jewish student in Waterloo to make an enduring commitment to Jewish life, learning, and Israel. Through promoting Jewish identity, cultivating student leadership and embracing religious and political diversity in an inclusive environment, Hillel Waterloo will enrich the lives of students on campus. We embody this mission and vision through our on-campus activities which range in content from Israel engagement, education, and advocacy opportunities, to social interactions, to community service and social justice, and to Jewish educational encounters. In addition to our events, we also strive to connect students with other religious groups in the Waterloo community by running joint events. All of our events are open to Jews and non-Jews alike as well as individuals from all walks of life, all we ask is that they have an interest in what we are doing. All of our events are advertised through our website,  page, email newsletters, as well as in-person interactions.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Hindu Students Council at the University of Waterloo",
        "overviews": "The Hindu Students' Council (HSC) is an international forum that provides opportunities to learn about Hindu heritage through various activities, events and projects. HSC presents ample opportunities for self-development at the spiritual and professional level.Our main goal is to provide a forum with which Hindus, on and off campus, can celebrate being Hindu and Hinduism through a variety of religious and cultural events. We work to provide these basic services to the University of Waterloo so that the Hindu community at UWaterloo, and those interested in Hinduism, may have the opportunity to take part and experience the rich and vibrant Hindu culture.But don’t be intimidated. Just because you’re not Hindu doesn’t mean that you can’t join HSC and take advantage of all the services and events that we offer. One of the main goals of the Hindu Students’ Council is to provide a forum for those who aren’t Hindu, giving them an opportunity to experience the culture, the food, and the teachings in a social environment. We always love seeing new faces and hearing different viewpoints and similarities with various ethnic groups. Everyone is welcome from all walks of life!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Hip Hop, UW",
        "overviews": "The purpose of The University of Waterloo Hip Hop Club is to provide a fun, social environment where students can learn hip hop dance. Members of the club have the opportunity to grow as dancers by being exposed to different styles of hip hop dance, while meeting others who are passionate about dance. Practices help members to develop balance, coordination, strength and confidence.UWHH is open to anyone and everyone willing to learn. Students of any experience level are welcome! Members range from inexperienced dancers to dancers at the advanced level.No audition is required to be a part of the club. Any member may perform with UWHH at events and competitions throughout the term as long as they can commit to attending the practices.",
        "membership_type": "\n- Hosting of events which require professional choreographers to be brought in\n- Purchasing of club related equipment\n- Purchasing of member related benefits (apparel, transportation to/from external events)\n- Use of funds for performance team needs\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Hong Kong Students' Association",
        "overviews": "UWHKSA is a club for those who are interested in Hong Kong culture. Our goal is to strengthen the Hong Kong community within the University of Waterloo and to promote Hong Kong culture and Cantonese.",
        "membership_type": "\nPurchase necessary materials for events\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Humans vs. Zombies Society",
        "overviews": "Humans vs. Zombies is a game of tag between two teams where Humans have to defend themselves with Nerf blasters and socks to survive as long as they can against a growing Zombie horde out to tag them. Humans vs. Zombies Society runs a weeklong game per term as well as weekend minigames and an annual open invitational game.Join our Discord server today:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://discord.gg/HFEd8hpJAb"
            ],
            "Email": []
        }
    },
    {
        "names": "Impact Alliance",
        "overviews": "Impact Alliance is the Sustainable Development Goals (SDG) Student Hub for the University of Waterloo. Directly affiliated with the Sustainable  Development Solutions Network Youth (SDSNY), the hub educates, engages, and takes action on the United Nations' 17 SDGs.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Improv Club, UW",
        "overviews": "UW Improv meets every week for games, exercises, sports and warfare from the world of *improvisational drama*, made famous by Whose Line is it Anyway. Our objectives are fun, enjoyment and belly laughs-- no experience necessary, drop-ins welcome!Also available is a Performance Team, which is compiled at the beginning of every semester-- auditions take place during the first few weeks of a new semester.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Indian Cultural Association, UW",
        "overviews": "UW Indian Cultural Association is a club that aims to promote Indian culture to the staff and students at the University of Waterloo by organizing various cultural events and dance performances. This club aims to provide a comfortable space where students and staff of Indian origin and/or students interested in Indian culture can come together and enjoy each others company.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Indonesian Students' Association",
        "overviews": "The main purpose of the club is to gather all students in University of Waterloo and community at large that are interested with Indonesian culture and language. We promote Indonesian culture and language through social gatherings, cultural sessions and fund raising activities. Lastly, we want to be a medium for members to meet fellow Indonesians or others who are interested in Indonesia.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Iranian Students' Association of Waterloo",
        "overviews": "Iranian Students’ Association of Waterloo’s mission is to unite the Iranian students at the University of Waterloo and other universities through cultural events and gatherings. ISAW provides a non-political environment where all members support one another and share ideas to improve society to its full potential. ISAW respects and supports people from all nationalities, backgrounds, identities, and origins; as well as welcoming everyone to visit any of the year-long events to become familiar with the Persian culture and background.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Jamnetwork",
        "overviews": "Attention University of Waterloo students...FINALLY, there's a space for musicians of all levels and backgrounds to come, relax, and get groovy.Whether you're a master jazz pianist, absolute beginner, or if you just want to learn how to play Wonderwall around a campfire, JamNetwork is the place to play. Come meet fellow music people and learn improv and theory skills along the way. (Don't worry - you don't need to know how to play Bohemian Rhapsody.) You can even just come watch and experience music. Everyone is welcome! With weekly drop-in meetings and field trips/community outings, we're all about expanding the music scene in Waterloo. So come one, come all, and let's make some magic together.: \n: jamnetwork_uw",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "Jamnetworkuw@gmail.com"
            ]
        }
    },
    {
        "names": "Kingdom Come",
        "overviews": "We are a campus movement dedicated to helping students discover Jesus and mobilizing the next generation for the kingdom of God.\nOur primary focus is to help university and college students across Canada experience God’s love and forgiveness and to inspire them to influence others to become lifelong followers of Jesus.Stay updated on our events by following our  (@kc_waterloo).Learn more about Kingdom Come on our website ) or  channel (KingdomComeKC).",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "(kingdomcome.ca"
            ],
            "Email": []
        }
    },
    {
        "names": "Korean Catholic Gathering",
        "overviews": "no description",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Korean Christian Fellowship",
        "overviews": "We are a community of students passionate about knowing God and participating in his work on campus and in the world. Together we pursue transformation through Scripture to lead and equip others to join in Jesus' extraordinary revolution. Whether you are a Christian, curious, or simply exploring who Jesus is, we would love to help you get plugged into our community! We have small groups, prayer times, and bible studies happening throughout the week and regular large groups on Fridays where we gather for a time of worship and fellowship.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Latin American Student Association (LASA)",
        "overviews": "At the University of Waterloo, the Latin American Student Association (LASA) is dedicated to celebrating Latin American culture, fostering awareness and building connections within the Latin American community. We aim to strengthen the Latine student body at UW through engaging meetings, vibrant cultural events, active community involvement or simply a place to hang out and play games. ¡Todos son bienvenidos! LASA is open to anyone interested in Latin American culture, whether you identify with it or are simply curious. Join us!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Law & Business Nexus (LBN)",
        "overviews": "Welcome to University of Waterloo’s first networking club in the Law and Business fields. We here at Law and Business Nexus provide students with opportunities to network with working professionals in these industries to showcase examples of possible careers available. We host events for students to meet with guest speakers and ask questions regarding their day-to-day activities, occupation and industry. Law and Business Nexus is the perfect club for students to discover, grow and foster their passion and interest in Law and Business.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Low Vision Interest Group",
        "overviews": "Low Vision Interest Group is an Optometry student group that provides educational and experiential learning opportunities aimed at increasing awareness of low vision practices and rehabilitation.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "MEDLIFE UW",
        "overviews": "MEDLIFE is a non-profit student organization that aims to alleviate global poverty through the distribution and promotion of Medicine, Education, and Development. With a network of over 50 chapters in universities across North America, MEDLIFE continues to grow. Get involved with local volunteering, fundraising, and international volunteering with the Service Learning Trips!Join MEDLIFE today!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Make-A-Wish UWaterloo Chapter",
        "overviews": "Make-A-Wish is a non-profit organization that was pioneered in Arizona, USA and has been ever since working effortlessly towards creating wishes for children with critical illnesses. It is the world’s leading children’s wish-granting organization and serves every community in Canada. Since 1983, Make-A-Wish Canada has granted over 36,000 wishes across the country and has been working efficiently to grant even more in the coming years. As Make-A-Wish foundation is a non-profit it relies on donations and grants which is what this club would aim for. Make-A-Wish UWaterloo Chapter is an affiliation of the Make-A-Wish foundation Canada and operates solely to raise funds via multiple fundraising/charity events. By being a part of this club you would not only be contributing your time and efforts towards a better cause but would also be a significant member of society by working towards a better future for all.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Mambo Club",
        "overviews": "The objective of Mambo is to teach international salsa dancing to the UW community. We provide weekly lessons and practice sessions in a friendly, social, and relaxed environment where dance enthusiasts of all levels can participate. Check out  for more details.",
        "membership_type": "\nend of term party, dance lessons, advertising (posters, business cards, apparel)\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "www.mamboclub.ca"
            ],
            "Email": []
        }
    },
    {
        "names": "Mandarin Chinese Christian Fellowship",
        "overviews": "We worship God and do bible study in order to learn the word of God through speaker nights, praise and worship nights, movies, and Bible studies.Feel free to reach out to us on wx (zhouyuzhe0609) or instagram (@uwmccf)!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Marketing Association, UW",
        "overviews": "UWMA is Short for University of Waterloo Marketing Association. UWMA fosters student interest in marketing and self-branding alongside providing services to local ventures and individuals. With the help of our leaders, sponsors, and general members we are driving towards being a professional marketing group within the next few years.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Metal KLVB, UW",
        "overviews": "The purpose of the club is to gather UW students to discuss and learn about metal music and its many different genres; introduce each other to new groups and learn about its history. We plan to hold meetings and social outings.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "MoMoSa",
        "overviews": "MoMoSa stands for Motivation, originality, Miracle, Organize Student Association. We believe that students are having unlimited intelligent but just need a chance and place to explore them. future are created by hands and hands are controlled by you.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Mock Trial Club",
        "overviews": "Want to be part of a real-life Suits cast? Join our club today! We host and participate in mock trial court simulations, both recreationally and competitively. Come out and meet others interested in law, no matter your program. No experience is necessary!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Model United Nations, UW",
        "overviews": "We discuss the political, social, and economic state of the world via student driven and focused debate. Using this debate, we endeavour to also expand the individual awareness of the world at large, and discover possible solutions to the issues plaguing the world and the people within. The University of Waterloo Model United Nations has at its core the goal of making its members into more aware and capable global citizens, through open debate and engagement on the issues of the world through the club's events and initiatives.",
        "membership_type": "\nPaying for food and equipment for in-house conferences.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Musical Interdudes - A Cappella Affiliate",
        "overviews": "The Musical InterDudes are a small-sized mixed-voice auditioned group with a focus on musical comedy. We consist of ✨boring✨ music practice, ✨terrible✨ socializing, and ✨fun✨ admin talk. We place a large emphasis on member input, and strive to find ways to incorporate members' ideas into the tear producing, knee-slap inducing, rolling on the floor laughing set we create for UWACC's end-of-term concert, gigs, and anything else you can imagine.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Muslim Students Association - Orphan Sponsorship Program",
        "overviews": "Our main goal is to raise awareness about local and international orphans and fundraise money which will be donated to orphan sponsorship organizations. We strive together towards our goal by arranging games nights, movie nights, and general fundraising activities to raise awareness for our club. We're always looking for enthusiastic people to join our team! Interested? Reach us through our social media or email us at",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uwmsa.orphans@gmail.com"
            ]
        }
    },
    {
        "names": "Muslim Students' Association (MSA)",
        "overviews": "The Muslim Students' Association (MSA) at the University of Waterloo seeks to create a community that is open and dynamic, which caters to the best interests of all Muslims on campus. Our main goals are to provide an Islamic environment for the Muslims at UW, and to raise awareness of Islam among non-Muslims. We achieve these goals by providing services and support for Muslims on campus, and by organizing lectures, conferences, and Islam Awareness Weeks each term for the general UW population.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "North African Student Association",
        "overviews": "Join Us:\nWhether you're from North Africa ( Morocco, Egypt, Libya, Tunisia, Algeria, Mauritania ) or have roots in the region, or are simply passionate about exploring diverse cultures, NASA welcomes you. Join our community and be part of a dynamic group that celebrates the beauty of North Africa while fostering unity and understanding.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Pakistani Students' Association",
        "overviews": "The Pakistani Student Association at the University of Waterloo is an organization that coordinates educational and social activities which promote Pakistani culture to the Waterloo community. Follow us on our social media pages!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Photography Club, UW",
        "overviews": "University of Waterloo Photography Club (UWPC), is a community of photographers who learn from and inspire each other.Our activities include workshops about fundamental and advanced photography techniques. We also arrange events including photo walks, exciting trips to neighboring cities and towns, and many more activities throughout each term. If you are interested in photography and wondering how to start, you are more than welcome to join our community, we have experienced photographers and executives to help you started. And if you are an experience photographer, come and join us.We provide event opportunities for those who want to put their skills to use; As well as equipment rentals and dark room services.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Pokémon TCG Club",
        "overviews": "The Pokémon TCG Club creates an environment in which Pokémon enthusiasts may come together to play against eachother, trade/sell cards and compete in tournaments! No matter if you are already an experienced Pokémon TCG master, a completely new player, or someone that just likes Pokémon, we welcome anyone who is interested. Feel free to drop in if you would like to learn how to play, play against others or even just talk about Pokémon with others of the same interest!Join our Discord to be part of the community!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Power to Change (Campus Crusade for Christ)",
        "overviews": "Power to Change is a Christian club who exists to serve the spiritual needs of students on campus.   Anyone and everyone is welcome to our club--whether you are a Christian or not.   We would love to hear your life story.The core of our ministry consists of engaging events, discussion groups, prayer meetings, bible studies, weekly meetings, conferences, and spring/summer mission’s trips.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Pre-Pharmacy, UW",
        "overviews": "The UW Pre-Pharmacy Club was created for students by students to act as a resource for those who have a passion for the pharmacy profession. Throughout the years the UW Pre-Pharmacy Club has become much more than just a resource to students. We are a dynamic club that creates an environment where it’s possible to interact and meet students with the same career goals as you. Even if you are merely considering pharmacy as a possible career we provide fun and interactive events that allow you to imagine what being a pharmacist is like. Our annual Pharmacy Olympics in the winter term, for example, make you scramble to count candy as fast as you can, basically stimulating a busy pharmacy after a holiday. We also provide talks with guest speakers (pharmacy students and pharmacists), information sessions, tours and much more!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Product Management Club",
        "overviews": "The vision of Product Management club is to foster product leadership and perspective among engineering­-focused students regardless of the career path and help students break into product management.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "QTPOC KW",
        "overviews": "QTPOC KW is a student-run club that provides the space for individuals at the intersection of 2SLGBTQ+ and racialized (Black, Indigenous, POC) identities to play freely and build community. We focus on hosting community socials, panels, and other events that uplift our intersectional identities.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Riichi Mahjong UW (RMUW)",
        "overviews": "Our club aims to provide a space for players of all skill levels to come together and play mahjong, with a specific focus on Japanese Riichi mahjong. However, we welcome players of all backgrounds to learn more about mahjong in a casual setting, through regular in-person, and online meetings. Riichi Mahjong UW does not operate on a gambling-basis, but instead prioritizes enjoying mahjong in a welcoming environment.Beginners are welcome!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Romanian Student Association",
        "overviews": "Salut! The Romanian Student Association (RSA) at UW is dedicated to celebrating Romanian culture, building connections within the Romanian community and providing students with the opportunity to connect with others who share similar roots or interests in Romanian culture and customs. We host several social events throughout the year to celebrate important Romanian traditions like December 1st, Martisor in March and fun hangout socials such as movie nights and more. This is a great learning opportunity for every student looking to learn more about Romania and its people, regardless of their background. We look forward to inspiring and giving insight to students about our culture and traditions and welcome anyone to participate and become a member of the RSA. Any questions or concerns can be expressed on our  page (University of Waterloo Romanian Student Association). Join today!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Rubik's Cube Club (formerly twisty puzzles), UW",
        "overviews": "This club's goal is to promote the awesomeness and furthered learning of all things associated with, and including, the Rubik's Cube (including the Rubik's Snake, Rubik's Magic, Rubik's 360, Rubik's Clock and the Megaminx, just to name a few).",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "SMILE (Students for Mental health and Inner Life Enrichment)",
        "overviews": "The purpose of the SMILE Club is to foster mental health awareness, well-being, and community among UWaterloo students. We aim to provide easy and enjoyable access to mental health and psychoeducational resources.",
        "membership_type": "\nAlthough the SMILE club is free to join, upon joining the club, members are asked if they are willing to donate to the club. All the donated money will be used for holding club events and resources provided by the club.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "SOCH Mental Health UW",
        "overviews": "SOCH Mental Health UW is a chapter of the SOCH Mental Health organization. In Hindi, Punjabi, and Urdu, the word SOCH means \"to think\" or \"a thought\". The founders of the SOCH Mental Health Organization brought this word to represent their mission as they believe to combat the stigma around mental health, we must change the way our community \"thinks\" about mental health. The mission of UW SOCH is to empower the community members of our university environment to recognize and accept mental health as an essential part of their well through education, prevention, and building resilience. SOCH will work to bring an open space for mental health conversations in both virtual and in-person settings. With the emphasis on mental health stigma in the South Asian community, SOCH looks forward to supporting the need for culturally and linguistically appropriate mental health conversations across the university campus. SOCH provides workshops rooted in mental health promotion.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Serbian Student Association",
        "overviews": "The Serbian Student Association (SSA) allows Serbian students as well as other undergraduate students to come together and be open to the idea of networking, running potential fundraisers, and holding social gatherings where our culture can be shared and shown amongst other students. We look forward to inspiring and giving insight to students about our culture and traditions, and welcoming anyone to participate and become a member of the SSA. Any questions or concerns can be expressed on our  page (University of Waterloo Serbian Student Association).",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Sikh Students Association (SSA)",
        "overviews": "The University of Waterloo Sikh Students Association (SSA) attempts to provide an environment on campus, and beyond, that helps to promote the Sikh religion by practicing its beliefs and traditions. The above is achieved through various discussion groups, weekly path sessions, kirtans, guest speakers, Q/A periods and a variety of religious/language classes provided by fellow students. As well, UW SSA attempts to participate in a wide range of multi-cultural activities both on campus, and within the Sikh community (such as trips to the Gurdwara, Vaisakhi, etc).In addition, our club organizes a number of intramural co-ed sports teams (Basketball and Volleyball, usually) and social functions (pool tournaments, bowling, etc.) and outings (dinners, horseback riding, skiing trips) that form the bulk of our time commitments.We hope to create a 'family' atmosphere by developing an hierarchy-less club that is devoted to providing an avenue for interaction amongst Sikh students at our University. UW SSA also provides educational help (study groups, old texts, exams, etc.) and holds one of the most successful on-campus events, 'Dastaar day', previously known as 'Turban Day' once a semester. This is an awareness day to teach the University community about the significance of the turban in Sikhism. We desire to produce conditions conducive to the further study, research and practice of Sikhism by our fellow Sikh students and all others interested in any aspect of the Sikh religion.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Smash, UW",
        "overviews": "We play super smash brother melee for the Nintendo GameCube.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Socialist Fightback Club at Waterloo University",
        "overviews": "The Socialist Fightback Club serves as a base for socialist politics on the UW campus. Education on questions of theory, history, economy, philosophy, on contemporary issues and movements are regular discussed and debated in the club, often through our publications, discussion groups and public events. In the past year, for example, we have held discussions on the topic of the economic crisis, the need to organize, the Oka Crisis, and on the basic tenets of socialist theory.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Somali Student Association",
        "overviews": "The purpose of this club is to gather University of Waterloo Somali and non-Somali students in order to connect, share information and socialize in a relaxed and inclusive atmosphere. The club will educate both members and non-members about Somali culture, raise funds for various causes regarding the community on a local and global scale. The club is open to undergraduates and graduates that are either Somali or non-Somali from the University of Waterloo.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Stocks Club",
        "overviews": "Stocks Club is for anyone, no matter your investing experience, to make sense of the world of finance, keep up to date with stock market news, and enhance your investing knowledge. Check out @letstockaboutit on  for more information.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Students For Life, UW (UWSFL)",
        "overviews": "UW Students for Life (UWSFL) is a Pro-life club whose aim is to support women in crisis pregnancies through volunteer work and tangible resources, advocate for the rights of all human beings from fertilization to natural death, form club members to speak about these topics with confidence, and educate the student population about life issues. If you are interested in getting involved, please send us an email at .",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uwstudentsforlife@gmail.com"
            ]
        }
    },
    {
        "names": "Students Supporting Opioid Stewardship (S.S.O.S.)",
        "overviews": "Students Supporting Opioid Stewardship is a club that is dedicated to spreading awareness among the community and student population on the opioid crisis. Our mission is to de-stigmatize the public perception of those who may suffer from an opioid addiction, education the community on how to identify signs of an overdose, and improve public knowledge of attaining the overdose antidote, naloxone.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Sunshine Cheerful Crawling Club (SCCC)",
        "overviews": "The purpose of our club is to alleviate the academic stress and burdens of the students at the University of Waterloo. Crawling on the ground can effectively relieve our stress, unleash our nature, and establish a deeper connection with nature.Therefore, as long as crawling activities are carried out with sufficient protective measures, they can help us, who sit for long periods, exercise, improve physical health, and maintain our mental state by engaging in a behaviour that releases our nature together with friends and family, temporarily forgetting various pressures from academics and life.In addition, crawling is an activity that combines strength, balance, speed, and flexibility, providing better overall exercise, especially for the shoulder muscles, waist, back, and abdominal core muscles, compared to other sports.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "TMA (Thaqalayn Muslim Association)",
        "overviews": "The Thaqalayn Muslim Association was founded in early 2012. The club was formed by a group Shia Ithna Asheri Muslim students in response to a lack of an official support network for the post-secondary Shia Muslim students in the Kitchener-Waterloo region. Although the headquarters of TMA Waterloo's activities is the University of Waterloo's main campus, the TMA aims to be accessible to all post-secondary students in the region. Thus, the TMA Waterloo’s purpose is to cater primarily, although not exclusively, to the needs of the Shia Ithna Asheri Muslim post-secondary students at the University of Waterloo, and the surrounding region, while simultaneously representing their collective voices and pursuing their ideals.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Tea and Culture Club",
        "overviews": "Just a place to drink tea, eat snacks, play games and have fun! Usually, we meet every week for 3 hours. Come on out and drink as much tea as you could possibly want. Fees are $3/session or $15/term. There will also be some special events with alternative pricing which you can find out through our  or Discord listed below.Our  page: \nOur Discord channel:",
        "membership_type": "\n$10 for full membership or $2 for individual meetings. The fee is necessary to break even on buying teas, snacks and prizes. Excess fees will be used either for following terms, to buy new games and activities for the club or for replacing equipment such as steepers and kettles when/if they break. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [
                "https://www.instagram.com/uwteaclub/"
            ],
            "Twitter": [],
            "Website": [
                "https://discord.gg/h3kdHw2"
            ],
            "Email": []
        }
    },
    {
        "names": "Teaching Students' Association",
        "overviews": "The Teaching Students' Association is an association to promote interaction amongst University of Waterloo Students interested in a career in teaching or teaching in general. The association allows students with such an interest to come together to network and socialize along with attending academic focused events to help motivate students with said interest in teaching.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Tech+ UW",
        "overviews": "Tech+ UW's mission is to cultivate a more inclusive and diverse tech community at UWaterloo by making resources more accessible to the community and students in need. We connect UWaterloo students with experienced and passionate individuals from different domains in tech, and foster this community through events that bring everyone together.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Technology in Pharmacy Network",
        "overviews": "The Technology in Pharmacy Network is committed to bridging the gap between technology and pharmacy. In light of Amazon's interest in entering the pharmacy market, our goal is to bring not only the students of these two fields together but to also connect students with leaders that are already taking the steps to make that happen.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The AcaBellas - A Cappella Affiliate",
        "overviews": "the acabellas are the university of waterloo's premiere upper voice acapella group under the UW A Cappella Club (UWACC). we are out here serving the spiciest performances, with killer vocals and smooth choreography. in 2016, the bellas competed for the first time at the international championship of collegiate a cappella (ICCA) and placed 3rd in the central quarterfinals. you can check out our past performances and keep up with the bellas through our instagram @uwacabellas ;D",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The Bhakti Yoga Club",
        "overviews": "Our mission is to inspire positivity and resilience to empower a healthy mindset. The Bhakti Yoga Club is for open-minded students, all ages, who like to view issues by examining “the bigger picture”. It is about introducing spirituality to students from all different faiths and ethnic backgrounds. More specifically, tangible solutions based in ancient cultures to material problems. Anyone with an interest or curiosity in spiritual discourse, yoga and meditation, self-help, or simply a desire to try something new is welcome to any of our sessions.\nThe university community like University of Guelph, McMaster University and University of Toronto have clubs similar to this promoting Vedic principles and philosophies. With an increasingly influential “next generation” in these ever-growing communities, we also thought it was about time to bring the young people from these organizations together to discuss the ideas we were brought up with and celebrate the unity in our diversities in an academic setting. Want to challenge a narrative you were taught? We probably do too!\nYou don’t need prior experience with any of these ideas to join our club. Bring your own opinions, approaches to life and concerns and let’s learn from each other! Our goal is to create a network of like-minded deep thinkers on campus through chill discussions, free workshops, musical meditation and more.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The Circle K International Club of University of Waterloo”",
        "overviews": "The club will be a branch of an organization called Circle K international, which is a non-profit community service organization that offers different volunteering opportunities. Circle K International student-led collegiate service program. Volunteer placement will be decided by a general club consensus and will include a variety of different environments such as nursing homes, soup kitchens, charities, hospitals etc.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The Islamic Information Center of the University Waterloo (IICUW)",
        "overviews": "The Islamic Information Center of the University Waterloo (IICUW), is a registered Federation of Students club that promotes the intercultural diversity amongst society in Canada by enhancing interfaith tolerance and relationship through the improved perception of Islam. The IICUW strives to provide the local community with accurate and unbiased information regarding the principles of Islam. In order to achieve this noble aim, the IICUW facilitates the awareness of Islam by providing the following services:\nFree copy of the Holy Quran (English Translation) Free Islamic Information Booths (in SLC) Free Books/DVDs on Islam Free Discover Islam Workshops Free Movie Nights (Documentaries/Lectures) Free Visit to Local Mosque Any information you need about Islam.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The Unaccompanied Minors - A Cappella Affiliate",
        "overviews": "The Unaccompanied Minors are the University of Waterloo’s premier mixed, auditioned a cappella ensemble. The Minors consist of 16 to 26 musically talented students who have been singing, beatboxing, and rocking out to everything from top 40 hits to rock classics since 2009. Focusing on blend, musicality, and performance, the Minors have been spreading the aca-love wherever they go. From the Kitchener-Waterloo Area at campus events like TEDxUW, to the United States to compete at the International Championship of Collegiate A Cappella, the Minors have blown away audiences with their outstanding arrangements and enthusiasm. Interested in the group? Feel free to contact us!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The University of Waterloo Project Rozana Chapter",
        "overviews": "The University of Waterloo Project Rozana Chapter is a club that seeks to further the objectives of Project Rozana: promoting cooperation between Palestinians and Israelis in the healthcare field, ultimately putting into practice the idea of health diplomacy. Particularly at the University of Waterloo Chapter, the club is focusing on raising awareness and fundraising for Rozana’s cause to maximize the opportunity to facilitate meaningful and lasting change. Ultimately, we seek to promote sustainable institutions and capacity building, strengthening the Palestinian health system as a fundamental pillar of Palestinian statehood.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "The Water Boys - A Cappella Affiliate",
        "overviews": "The Water Boys are a lower-voice auditioned group under the UW A Cappella Club (UWACC). : \n: \n:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [
                "https://www.youtube.com/waterboysacappella"
            ],
            "Facebook": [],
            "Instagram": [
                "https://instagram.com/waterboysuw"
            ],
            "Twitter": [],
            "Website": [],
            "Email": [
                "waterboys.acappella@gmail.com"
            ]
        }
    },
    {
        "names": "The Women's Network (TWN)",
        "overviews": "The Women’s Network (TWN) was created for ambitious women looking to grow professionally while being lifted by their community. TWN offers opportunities to gain exposure to the professional world, network with high-profile speakers and meet peers around their campus and the country. TWN holds speaker meetings, various networking events, resumes, internship and LinkedIn workshops, alumni networking receptions and interactive activity sessions to develop relationships with fellow members. Our workshops and guest speakers help prepare you for your next steps and may open your eyes to paths you haven't even considered.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Turkish Students Association",
        "overviews": "The Turkish Students' Association of the University of Waterloo (TSA) aims to facilitate networking within the Turkish community, as well as those who speak Turkic languages. The club promotes Turkish culture among students in the Kitchener/Waterloo community by organizing cultural, educational, and/or entertaining events. We gather for social occasions not only to have fun, but also to share our passions, talents, and similarities while embracing the Turkish culture. The TSA welcomes all the different cultures and ethnicities who are interested in learning about and/or mixing within the Turkish culture!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW ACE Chapter",
        "overviews": "DECA is an international student organization that joins college and university students together to engage in business related activities.These include seminars and conferences, professional development, competition, community service, and public speaking.DECA programs and activities are focused on helping members grow and develop as professional business leaders. DECA focuses on networking with other students as well as professionals, improving communication and leadership skills while Increasing your knowledge in the areas of marketing, finance, entrepreneurship and management through case studies, tests and role plays.",
        "membership_type": "\nDECA U membership fees (international headquarter fees) and fees to events (BOT, EOT, in-house conference).\nWe actually have 2 fee structures: for members interested in getting involved with DECA U events, there is a $30 fee per year. For students who only prefer local events, the fee is only $10/year. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Blockchain Club",
        "overviews": "The UW Blockchain club is a network of students interested in Blockchain technology.After Bitcoin was released, people soon realized the immutable structure of Blockchains can be extended to be much more than just a store of value. At UW Blockchain Club, we discuss that underlying technology and it's implications.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Board Games Club",
        "overviews": "Welcome to the UW Board Games Club! We're a club that provides a relaxing, awesome, and friendly environment to learn and play new board games, while also meeting some cool new people. Join our Discord for more info: discord.gg/pNhZc9MN3n",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Book Club",
        "overviews": "A social club for people to gather and discuss various literary works of the written format, both fiction and non-fiction. And can include a variety of topics that include (but is not limited to): Science, science fiction, fantasy, suspense/thriller, romance, self-help, business/technology, etc",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Canadian Association for Global Health (UW CAGH)",
        "overviews": "We are the University of Waterloo Student Chapter of the Canadian Association for Global Health (UW CAGH). We represent a student-led initiative designed to foster research and networking in global health among University of Waterloo students across all disciplines. Our goal is to engage with students interested in global health research or who may be considering a career in the field of global health, to open opportunities for professional development. UW CAGH runs termly general member meetings and multiple events over each term to engage members and students in global health topics. We also have a mentorship program that pairs members with graduate students and professionals for development and networking experience.We invite students from all faculties at UW to follow us on instagram (@cagh_uw) and to join our general member email list for all event, experience, and executive opportunities:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://forms.gle/L3NNacJgPFVRz2Vt8"
            ],
            "Email": []
        }
    },
    {
        "names": "UW Cancer Foundation",
        "overviews": "UW Cancer Foundation is a student-run club that focuses on raising awareness within the student community on the topic of cancer and the various types of cancers that impact our society today. One of their goals is to create a variety of fundraising events that will aid in the fight against cancer. In addition, the club hopes to work alongside organizations such as the Canadian Cancer Society and the National Cancer Institute to support cancer researchers.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Charity Knitting Circle",
        "overviews": "The UW Charity Knitting Circle is a club where students can knit, crochet, or do other fibre arts together in a relaxing, social environment. The club also has the goal of creating blankets together as members to donate to charity. Knitters and crocheters at any level of experience, including those who have never knit or crochet before, are welcome to join and either learn a new craft or develop their existing skills. Yarn and tools are provided.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Chinese Instrumental Orchestra",
        "overviews": "The UW Chinese Instrumental Orchestra Club welcomes everyone who’s passionate about traditional Chinese music and wish to play classical Chinese instruments as part of the orchestra. The goal of playing and promoting Chinese music is expected to be achieved through bi-weekly rehearsals, bi-weekly sectional tutoring, and performances. Players at all levels are welcomed to join! Contact us through our email:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uwchineseorchestra@gmail.com"
            ]
        }
    },
    {
        "names": "UW Cuban Salsa Club",
        "overviews": "UW Cuban Salsa club works closely with Laurier Salsa club and dedicates to spread the joy that Casino Rueda (Cuban Salsa) brings to all of us! Check out our Youtube videos showcasing our performances and our  feed for more information!",
        "membership_type": "\nThere will be a membership fee of 10 CAD (Canadian dollars), which will be used for advertisement of the club (i.e. posters, flyers), nametags for the members as well as club members events expenses. The money will be kept in the Federation of Students bank account and will be deposited directly in the account within one week of being collected. The money will be spent according to the club’s constitution and any approved expenditures will be paid via cheque. If the money is not spent in its entirety it will be kept to be spent on events on following terms, never staying in the hands of either the members or the executive body.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Cyber Security",
        "overviews": "To build a community within the University of Waterloo that promotes student’s education, participation, and leadership in the field of Cyber Security.  A community for anyone interested in Cyber Security to learn, network and hone their skills to prepare themselves for a field that’s increasingly important to the world’s security.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Dhamaka",
        "overviews": "UW Dhamaka is a club to bring together the community of Indian dancers and fuse Bollywood music and dance culture into the UW student body. The club aims to infuse the different cultural dance forms in Bollywood such as bhangra, kathak, bolly-hop and more.",
        "membership_type": "\n$10 for individuals, \n$7 with a friend.\nMembership fees will be used for booking studio sessions, buying speakers and fundraising for possible competition travel, costumes, and participation. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW EmpowerCycle",
        "overviews": "Menstruation is often stigmatized across diverse cultures and communities and is associated with negative connotations. The founder of the UW BleedBright strives to eradicate this stigma by addressing this topic that affects billions of women every day. UW BleedBright is an organization that is committed to uplifting and empowering marginalized women in period poverty, which is a crucial public health concern. Period poverty refers to the inability of women to access menstrual products due to financial constraints. It is estimated that Canadian women spend up to $6,000 in their lifetime on menstrual hygiene products. At UW BleedBright, we believe that menstrual products should not be a luxury but a necessity. Periods are often used interchangeably with menstruation. Hence, the founders of UW BleedBright in this word to represent our club, as it combats the stigma and negative connotations that are often associated with menstruation.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Entrepreneurship Society",
        "overviews": "EntSoc aims to build inclusive innovation at UW by exposing students of all faculty and experience levels to the entrepreneurial ecosystem. We do this by building bridges between campus organizations and clubs, connecting students to resources, running events, and working on internal projects that fill gaps within the entrepreneurial ecosystem at UW. Here are some of our campus partners: Conrad School of Entrepreneurship and Business, Concept, The Problem Lab, GreenHouse, Coffee n' Code, UWVR, WiSTEM...and many more!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Futures in Rehabilitation Sciences",
        "overviews": "The UW Rehab Sci Club aims to help students learn about careers within the field of rehabilitation sciences, including but not limited to: physiotherapy, occupational therapy, and speech-language pathology. Join us and learn about the nature and scope of these professions through info sessions, social media takeovers, infographics, and more!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Geospatial Club",
        "overviews": "The UW Geospatial Club runs workshops that teach geospatial analysis and data modelling skills across multiple GIS platforms. The club also performs volunteer geospatial consulting work for a number of community organizations.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Gives Blood",
        "overviews": "The need for blood donations are high, and currently there is little to no presence of Canadian Blood Services on the UW campus. Until now! Our club's purpose is to raise awareness of the growing demand for blood donations, to encourage students to donate blood, and to empower students to become more involved with Canadian Blood Services.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Go Club",
        "overviews": "The University of Waterloo Go Club is a community where students can come learn, play and study the game of Go. We host weekly meetings and provide an environment for both new and experienced players.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Kpop Club",
        "overviews": "UW Kpop Club was created to bring kpop fans together and share our common interest in Korean popular culture. It will be a safe place to discuss and share kpop related topics.  Members will be able to participate in events to express their interest in kpop and meet fellow kpop fans at the Unviersity of Waterloo.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Management Consulting Club",
        "overviews": "The UW Management Consulting Club seeks to attract students and help them acquire the basic skills needed to succeed in pursuing opportunities in the consulting industry. Our club holds events that not only facilitate the networking process between UW students and recruiters at top consulting firms, but also prepare students to be successful in their interviews.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Mario Kart",
        "overviews": "Attention all racing enthusiasts and Mario Kart fans at Waterloo! Are you ready to take your skills to the next level? Look no further! We are thrilled to introduce the most exciting club on campus: UW Mario Kart! Get your engines revved up and prepare for an unforgettable experience.UW Mario Kart is a vibrant community of students who share a love for the iconic racing game. Our club offers a thrilling opportunity to connect with fellow gamers, participate in exhilarating tournaments, and explore the exciting world of Mario Kart like never before.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Mehfil",
        "overviews": "UW Mehfil is a dynamic platform where talents collide and melodies take centre stage. Whether you're an experienced classical musician or someone who revels in the beats of Bollywood, UW Mehfil invites you to share your unique talent. From classical renditions to impromptu Bollywood jam sessions, the club is a canvas for musical expression, providing a space for everyone to get lost in the world of Indian music.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Operation Smile",
        "overviews": "UW Operation Smile is a club affiliated with Operation Smile Canada, an organization that aims to raise awareness and provide medical assistance and surgeries to countries around the world for cleft lip and cleft palate. UW Operation Smile works to raise awareness of these conditions in the Kitchener-Waterloo region, and hosts a variety of fundraising events to help raise donations toward this cause.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Parks Canada Club",
        "overviews": "We are a student led group of outdoor enthusiasts in affiliation with Parks Canada and a part of their National Campus Clubs Network that connects our club with other universities in Canada. You don't have worry about your budget as Canada Parks helps subsidizes all our events. We host amazing adventures to national and provincial parks each term as well as take part in local stewardship activities. Furthermore, we host local field trips to conversations and historical sites, go on local hikes in the KW and surrounding region, have epic bonfires and awesome guest speakers.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Poker Studies Club",
        "overviews": "The UW Poker Studies Club (UWPSC) offers a fun social environment to play and learn about No Limit Texas Hold'em. Tournaments are held twice a week, providing an opportunity for new players to try out the game, as well as a competitive experience for those interested in sharpening their skills. Prizes are awarded to top performing players each event, and those who do consistently well throughout the term may receive an invite to the end-of-term tournament, where larger prizes are available.For more information, head to  or check out our socials!\nDiscord: discord.gg/2k4h9sM\n: /uwpokerstudies\n: @uwpokerclub\n: (Our tournaments have no mandatory buy-in or wagers. The club operates entirely on a non-gambling basis.)",
        "membership_type": "\n- Prizes given out at weekly tournaments\n- Food and beverages during social events\n- Maintaining club assets such as poker chips, decks, felts, etc.\n\n",
        "links": {
            "YouTube": [],
            "Facebook": [
                "facebook.com"
            ],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "uwpokerclub.com"
            ],
            "Email": [
                "uwaterloopoker@gmail.com"
            ]
        }
    },
    {
        "names": "UW Pre-Dental Club",
        "overviews": "UW Pre-Dental club is a club ran for Pre-Dental students at the University of Waterloo whether they are undergraduates or graduate students. The objective is to provide students with the necessary information that Pre-Dental students need such as running DAT workshops, application workshops, and interview workshops. Pre-Dental students will also find themselves impacting the community as oral promotion events will be held.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Pre-Med Club",
        "overviews": "UW Pre-Med Club is an event-based club under the Federation of Students. We are a student-run organization that provides assistance and networking opportunities for those interested in medicine and medicine-related careers. The club holds various events that provide information on topics such as the medical school application process, the MCAT and its associated preparatory courses as well as ways to get involved around your school and community. The club is open to students of all faculties at the University of Waterloo.",
        "membership_type": "\nThe purpose of the fee will be to help support the costs of running events like tours and supplying food such as pizza, cookies, etc. during these events for the members. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Quizbowl",
        "overviews": "UW Quizbowl is a club where all lovers of trivia meet! There are casual meetings where students can play against their fellow students as well as inter-university competitions. A wide range of topics are covered in the questions read, including academic subjects (such as science, history, music, etc.) and pop-culture. If you like trivia, feel free to drop by!Check out our social media for more information!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://linktr.ee/uwquizbowl"
            ],
            "Email": []
        }
    },
    {
        "names": "UW Relay for Life",
        "overviews": "Relay for Life is a committee where we come together to make a meaningful impact in the fight against cancer. Our mission is to raise funds, awareness, and hope in the battle against this devastating disease.Relay For Life is not just an event; it's an experience. Throughout the year, we organize various fundraising activities and educational initiatives to support cancer research, prevention, and support programs. Our signature, main event, the Relay For Life, is where teams take turns walking or running around a track to symbolize the relentless nature of the fight against cancer along with playing fun games and eat good food! As part of Relay For Life, we hold a moving Luminary Ceremony to remember those we have lost to cancer and celebrate the courage of cancer survivors. Together, we create a community of support and empowerment, making a real difference in the lives of those affected by cancer.Whether you're a survivor, a caregiver, a student, or a community member, everyone is welcome to join our club and be a part of this incredible movement. Together, we can help fund groundbreaking research, provide essential resources to cancer patients and their families, and bring hope to those touched by cancer.Join UW Relay For Life today and be a part of the fight against cancer! Together, we can make a difference and work towards a world where cancer is no longer a threat",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW SafeTails Initiative",
        "overviews": "UW SafeTails Initiative is a student-run, non-profit initiative that supports animal rescues and shelters in the KW region as well as in the GTA. So many animals live in shelters and they deserve to have the best possible care before finding their forever homes. UW SafeTails strives to support these rescues by raising money so that they can provide shelter animals with the best care during their stay at the rescues. Through informational campaigns, social media posts and club events, UW SafeTails creates a community for students passionate about animal rescue.List of potential organizations that any raised proceeds would be donated to:\n- Kitchener Waterloo Humane Society\n- Eight Paws Dog Rescue (2022 Canadian Registered Nonprofit organization)\n- Animal Alliance of Canada Fund (Registered Canadian Charity)\n- Cat Busters Animal Rescue (Registered Canadian Charity)\n- Companion Animal Rescue Effort (Registered Canadian Charity)",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Scrabble",
        "overviews": "The UW Scrabble Club is a club where Scrabble enthusiasts, casual players, and people who are interested in trying a new game can come together and play Scrabble.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Society of Addictions Awareness (UW SAA)",
        "overviews": "UW Society of Addictions Awareness (UW SAA) is a club that aims to promote awareness in the field of addictions and substance use disorders. Our goal is to prepare future health professionals to effectively deal with the complex health challenges and social issues surrounding addictions. This is accomplished by educating undergraduate students about addictions, providing exposure to potential career paths, and inviting guest speakers who are experts in the field of addictions. Follow us on  (@uw_saa) to join us and learn more!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Stem Cell Club (Formerly UW One Match)",
        "overviews": "UW Stem Cell Club is a club focused on raising awareness about bone marrow stem cells, while working on increasing the number of registered stem cell donors in our nation, starting with the University of Waterloo.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Street Dance",
        "overviews": "We are a community of dancers who are passionate about the heart of dance and hip hop culture. Whether you are interested in fundamentals, popping, hip-hop, locking or breaking, come jam with us and enhance your skills and diversity. We focus a lot on freestyle dance and play a variety of beats during our sessions, allowing anyone to express themselves freely, while still be able ask questions or gain greater insight on a certain groove or dance move. Our sessions will mainly focus on popping which is the technique of quickly contracting and relaxing muscles to create an intricate body movement. Popping also involves influences of hip hop, which will be practiced with grooves and rhythm. You do not need a background in dance to come, we are happy to session with you and teach you the skills that we have learned. Our club will differ from other HIP HOP clubs on campus through mainly focusing on freestyle dance sessions and not as heavily choreography based. If you want to expand your dance knowledge and be more free, come dance with us.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW Tetris Club",
        "overviews": "The goal of UW Tetris Club is to bring students together by enjoying the classic game of Tetris. Tetris is a fun, simple to learn game that can help students meet new friends and de-stress. Casual and/or competitive matches will be held weekly via Discord for students to bond over the exciting game of Tetris.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW VR",
        "overviews": "UW VR is canada's first University based Virtual Reality club.  It is dedicated to promoting the different applications of VR, the development of VR content and making it accessible to the general uwaterloo student body by holding various events and projects.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UW against Child Abuse",
        "overviews": "UW against Child Abuse is a club that aims to raise awareness and funds for the Child Rescue Coalition and other organizations with similar interests. This organization works to protect and rescue children from sexual abuse and child sexual abuse material.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UWBobaTime",
        "overviews": "The UW BoBaTime club aims to create an inclusive and safe space for all bubble tea drinkers! Join us to meet fellow bubble tea enthusiasts, and spend time relaxing while having a cup of boba on the side.",
        "membership_type": "\nThis fee is added so the club can generate funds to host better events in the future. As our club was initially intended to be a socializing club, where members could experience a variety of bubble tea, the allocated budget will unfortunately not be enough given the traction our club has garnered over the past term. We reflected on our active term and believed this is a necessary step in order to keep the club alive and provide a better experience for future terms to come. The fee would be $5 per member, which gives them access to the partnered stores for that term, as well as other benefits that may be implemented. By purchasing the membership fee students will receive a e-membership card, which will have their student number and name—which they can then present to stores along with their student card for the applicable discount.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UWTSS - UW Taiwanese Student Society",
        "overviews": "UWTSS’ goal is to connect and share to everyone who is interested in learning more about our culture. Explore various topics such as Taiwanese food, pop culture, street market, and bubble tea!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UWVSA (University of Waterloo Vietnamese Student Association)",
        "overviews": "To the University of Waterloo, we are your connection to Vietnamese culture, Vietnamese traditions, and the Vietnamese community. UW VSA strengthens the campus community through organizing social events, cultural events, and collaborations.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UWaterloo Chai and Verse",
        "overviews": "Chai and Verse strives to curate an inviting and intimate space for exploring and discussing poetry, folk tales, and other forms of literature and art, with a focus on South Asia.Everyone is welcome. We hope to be honoured by your presence.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "UWaterloo Meditates",
        "overviews": "UWaterloo Meditates is a meditation and breathwork club that brings stress management tools and techniques for personal and professional success through the scientific use of evidence-based breathing and meditation techniques, personal awareness seminars and community service projects. It's one of the coolest places to connect with yourself, make awesome friends, and, most importantly, have fun and be a part of an inclusive community!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Universal Finance Organization, UW",
        "overviews": "With the use of game nights, guest speakers, information sessions and newsletters, UFO aims to introduce new students to personal finance. Through various workshops, events, and competitions between members. UFO supports the career development of all students. We wish to contribute towards building a financially literate world.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Airsoft and Precision Sports Club (UWAPC)",
        "overviews": "The Airsoft and Precision Sports Club (UWAPC) is formed by a group of airsoft enthusiasts. We love discussing all things related to the hobby and the club will frequently organize get-together airsoft events at external locations. \nWe welcome hobbyists from all levels and would love to include beginners who are interested in learning more about the sport. If you are still not sure about joining the hobby, feel free to join our Discord server to ask any questions!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Bhangra",
        "overviews": "UWaterloo Bhangra is a club that aims to spread the love of the Bhangra dance form throughout the university in various different ways such as flash-mobs, regular recreational dance sessions, workshops and etc.\nUWaterloo Bhangra shall also aim to give students at Waterloo a chance to dance Bhangra at a competitive level, while representing the university amongst various other varsity-level Bhangra teams.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Canadian Association on Gerontology Student Connection (UWCAG)",
        "overviews": "The University of Waterloo Canadian Association on Gerontology Student Connection (UW CAG) is a club whose purpose is to promote interest in aging research. Our goal is to provide opportunities for undergraduate students to explore current aging research, learn more about careers in the field of gerontology, and engage in professional development.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Cantonese Chinese Christian Fellowship",
        "overviews": "UW Cantonese Chinese Christian Fellowship (UWcCCF) is a Christian group on campus with a focus in Cantonese and English speaking students. We aim to build a community of Christian believers on campus, equip members with biblical knowledge, and evangelize others at the University of Waterloo. UWcCCF consists of mostly Christians rooted in Cantonese culture or from a Hong Kong background, however, anyone is welcome to learn more about God, connect with brothers and sisters, and share their love to people around them. We run various interactive activities during our weekly meetings, such as Bible studies, worship, prayer nights, games and outreach services. Please browse our  page to know more about us! We look forward to seeing you! group:  (General information)\n:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [
                "https://www.facebook.com/groups/uwcccf/"
            ],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "uwcccf@clubs.feds.ca"
            ],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Chinese Classical Dance Club",
        "overviews": "The UW Chinese Classical Dance Club (UWCCDC) focuses on practicing and performing traditional chinese dances. Members attend weekly sessions where they will learn how to practice chinese dance techniques such as stretches, kicks, and leaps. Part of each session will be dedicated to learning a traditional chinese dance so that members can appreciate the grace, elegance, and precision of the dance style. Sometimes members will also have the option to participate in a group dance performance with full costumes, props, and makeup. Our club welcomes all experience levels! If you have any questions please don't hesitate to contact us at .",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "uwccdc@gmail.com"
            ]
        }
    },
    {
        "names": "University of Waterloo Conservatives",
        "overviews": "University of Waterloo Conservatives is a group that connects university students to Conservatives parties. Students have the opportunity to volunteer on political campaigns, meet prominent Conservative politicians, and socialize with other Conservative youth. Past events have included hosting ministers, candidates, and having group socials.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Entomology Club",
        "overviews": "The University of Waterloo Entomology Club is a club for those passionate about insects or interested in a bugs world! We work to deliver educational resources to appreciate the importance of insects to people, the environment, and other organisms. Our goal is to inspire those around us to connect with and respect the insect world!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Filipino Students' Association",
        "overviews": "The University of Waterloo Filipino Students' Association is a club driven to help educate Filipinos and Filipinos-at -heart about the Filipino culture. Not only to gather for social occasions, but to create a tight-knit community sharing our many talents and resources.Get in touch with us!\n: \n: \nLinkedIn:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [
                "https://www.instagram.com/uw.fsa/"
            ],
            "Twitter": [],
            "Website": [
                "uwfsa@clubs.wusa.ca",
                "https://www.linkedin.com/in/uw-filipino-students-association-9413812b0/"
            ],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Global Dental Brigades (UW GDB)",
        "overviews": "Global Brigades in the world's largest student-led global health and sustainable development organization. Since 2004, Global Brigades has mobilized thousands of university students and professionals through nine skill-based service programs to improve quality of life in under-resourced communities through partner organizations in Honduras, Nicaragua, and Panama.University of Waterloo Global Dental Brigades (UW GDB) is a non-profit club led by determined students interested in the fields of dentistry and healthcare. This club consists of Executive Members and General Members who get an oppourtnity to volunteer locally and/or abroad to Honduras, Nicaragua, or Panama to create sustainable and positive impacts on under-resourced communities. Locally, we organize fundraising events, information sessions, collect oral hygiene supplies, and recruit brigaders. Then we travel abroad to run dental clinics in under-resourced communities. Our mission/goal is to strengthen under-resourced communities as well as the brigaders to overcome global health and economic disparities.",
        "membership_type": "\nMembership fees will be used for capital for fundraisers to reduce global health & economic\ndisparities.\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Korean Students’ Association",
        "overviews": "University of Waterloo Korean Students’ Association (UWKSA) is a cultural organization that aims to connect the Korean community through our social and academic events. We also promote Korean culture to help create a more inclusive environment.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Malayalee Association",
        "overviews": "The University of Waterloo Malayalee Association (UWMA) is a social and cultural club that aims to promote Malayalee cultures and traditions within the UW student body. This club will not only serve as a means to connect and create a sense of community for Malayalee students at UW, but also creates opportunity for non-Malayalee students to learn more and participate in Malayalee cultures and traditions. Through the organization of social events and cultural workshops, UWMA strives to create a welcoming and safe environment for all students at UW.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Moot Court",
        "overviews": "The University of Waterloo Moot Court is a club for students interested in building their verbal advocacy skills, knowledge of critical legal issues, and presentation abilities in a courtroom scenario. Members will have access to information sessions on the mooting process, networking opportunities with real legal professionals, and resources that will encourage them to succeed in moot competitions in their undergraduate careers and beyond.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo New Democratic Party",
        "overviews": "The New Democratic Party Club of UWaterloo is aimed at creating a welcoming and inclusive space for progressive students to learn about and participate in Canadian politics, at all levels. We will strive to lessen the barrier of entry, which prevents so many Canadians from getting involved in politics. We will do this by bringing together students who have already begun their political journeys and those who want to get started on their own, as well as politicians and activists who have established a political space for themselves, to work together for their common goals.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo Zoology Club",
        "overviews": "The zoology club is a community of animal-loving UW students. Through online engagement, educational campaigns, and group events, we are building a community of students that are passionate about everything animal related. We are eager to discuss and educate our UW peers on animal-related topics such as animal endangerment, local animals within our community, obscure animals you might not know about, and plenty more!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo's Beauty Club (UWBC)",
        "overviews": "In a highly academic setting, we aim to create a community and exciting events that promote self-care, self-expression and creativity through makeup, skincare, and hair! Everyone is welcome no matter their gender, race, sexuality, skill level or skin concerns.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "University of Waterloo’s Neuroscience Association (UWNSA)",
        "overviews": "no description",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Visual Arts Club, UW",
        "overviews": "Visual Arts Club welcomes all artists, designers, hobbyists, and those curious about art! We hold drawing sessions, explore different mediums and techniques, and hold themed events. All skill levels welcome! Meetings occur weekly.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Voices for Palestine",
        "overviews": "Voices for Palestine is a student-led organization at the University of Waterloo dedicated to advocating for peace, justice, and freedom for Palestine.We engage in a diverse array of activities, all designed to foster understanding and solidarity. Our efforts range from awareness campaigns and peaceful demonstrations to speaker series and film screenings. These activities are designed to highlight the rich Palestinian culture, history, and the ongoing struggles faced by its people due to Israeli settler colonialism and occupation.In addition to political advocacy, we place a strong emphasis on cultural promotion. Through various events, including cultural showcases, we strive to bring the vibrant Palestinian culture to the forefront, enabling students of all backgrounds to engage with and appreciate it.As Voices for Palestine, we believe in global citizenship and the power of collective action education, dialogue, and cultural exchange in fostering understanding and effecting change. We invite all students, regardless of their background, to join us in standing for a just and peaceful future for Palestine.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "WaterBoo!",
        "overviews": "Horror Club is a place where students can come together to enjoy the horror genre. Students can enjoy discussing the genre, experiencing it, and even developing their own horror-themed creations. Activities include watching horror movies, playing horror video games, reading horror stories, and anything else horror!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Arab Student Association",
        "overviews": "The purpose of the club is to promote Arab heritage through cultural, social, and educational events. We aim to build a community that connects students of Arab origin and/or interested in Arab culture to foster mutual support. WASA intends to strengthen the Arab community in UWaterloo and address Arab affairs.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Hockey Club",
        "overviews": "We are a group of hockey fans who enjoy getting together to take part in hockey related activities. Our club activities include getting together to watch livestreamed games on campus, going to see in-person hockey games, and playing fantasy hockey online throughout the semester. We welcome everyone from lifelong fans to those who are new and interested in getting involved in the sport. This club offers both a great way to socialize with new people and follow Canada's most popular sport.Join our discord!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://discord.gg/Y2Qexas8Av"
            ],
            "Email": []
        }
    },
    {
        "names": "Waterloo Ismaili Students' Association",
        "overviews": "The Waterloo Ismaili Students Association (WISA) is a not-for-profit organization that primarily provides a venue for Ismaili Muslim students attending UW to congregate for daily prayers. The club emphasizes a strong sense of community and also holds educational, social, and sports events for our members, in which the greater community is often encouraged to participate.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Movie Watchers Club",
        "overviews": "The Waterloo Movie Watchers club provides a medium where members watch and share appreciation for various types movies. We meet up once a week to watch a movie, critically analyze it and discuss it within the group. We recognize the importance of movies as a factor influencing culture and civilization as a whole. We meet every week to watch a movie as an entertainment, as well as a social gathering.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Punjabi Association (WPA)",
        "overviews": "WPA is a club that is designed to bring cultural diversity to the Waterloo community by being an organization that strives to express the Punjabi culture through various activities that are based on cultural events, holidays and traditions.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Real Estate Association",
        "overviews": "The Waterloo Real Estate Association (WREA) exists to provide students of all faculties with a platform to learn about the commercial real estate industry, network with like-minded peers and industry professionals, and develop the foundation for a successful career in this dynamic field. WREA has three key success factors: 1. To lift the veil on commercial real estate, showing students the viability of the field’s many rewarding careers, 2. Facilitate unique and inclusive events, allowing our members to build valuable connections with industry professionals, and 3. Host informative and interactive workshops/discussions to aid in bridging the gap between academia and industry.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Science Fiction & Fantasy Club (WATSFIC)",
        "overviews": "WatSFiC is the University of Waterloo’s Science Fiction and Fantasy club. With roots in sci-fi literature, the club has since expanded to include all things science fiction, fantasy, and TTRPG. The club hosts many games of D&D 5e, Pathfinder, and Call of Cthulhu for all levels of players from beginner to master along with lesser known TTRPG systems. There are always books and movies to talk about or something to play!",
        "membership_type": "\nClub resources and prizes for club contests\n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Snow Coalition",
        "overviews": "The Waterloo Snow Coalition (WSC) enjoys and promotes every\nbenefit of the university club experience! We host ski/snowboard trips and various other on and off campus events.  We are a great club for\n1st-years, grads, and exchange-students alike. We have a huge list of members and we expect even more to join our club throughout the winter each and every year during our amazing ski trips.",
        "membership_type": "\nSupport club events and ski trip costs, including busses, food, club merchandise, ect. \n",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Students and Microbiology (WatSAM)",
        "overviews": "Waterloo Students and Microbiology (WatSAM) was established to create an avenue for students from all six faculties to collaborate and network. This group is made up of students who are connected to microbiology and are dedicated to fostering the research and education of the study of microbial communities. WatSAM will educate and connect these students as well as facilitate their professional progress in the study of microbiomes.The purpose of the club is to gather University of Waterloo students, staff, faculty, and members of the UWaterloo community at large to\na) foster interdisciplinary collaborations and relationships between students and Waterloo Centre for Microbial Research (WCMR) members\nb) connect and educate students, both graduate and undergraduate, in the diverse world of microbiology",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Waterloo Sudanese Student Association",
        "overviews": "The Waterloo Sudanese Student Association celebrates and promotes Sudanese culture, fosters cross-cultural understanding and provides a supportive network for Sudanese students at the University of Waterloo throughout their academic journey. Cultural showcases, community outreach, academic workshops, collaborative events, social gatherings, fundraising initiatives, mentorship programs, and awareness campaigns are in store. Through these events, activities, and initiatives, the Sudanese Students Association at the University of Waterloo aims to create a vibrant and welcoming space that fosters cross-cultural understanding, academic growth, community engagement, and social impact, ultimately enriching the university experience for all members. We strive to create a diverse and inclusive space where all members can thrive and make a positive impact on campus and beyond. Join us in embracing the richness of Sudanese heritage and forging lasting connections within our university community. Fell free to reach out to us about any inquiries\n page: susawaterloo \n:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": [
                "susawaterloo@gmail.com"
            ]
        }
    },
    {
        "names": "Waterloo Warriors Gaana",
        "overviews": "The Waterloo Warriors Dance Team is open to all students of Waterloo with a passion for learning and growing in the art of dance. We aim to provide a platform for the expression of South Asian culture and dance styles. Some styles we perform include Gaana, Bharathanatyam, Bollywood along with Hip Hop and Dancehall. Our goal is to provide a fun and positive environment for students to share their talent and passion for South Asian dance, while also challenging them to grow as dancers. We welcome students of all dancing backgrounds as we have both competitive and non competitive events.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Women in Pre-Law",
        "overviews": "WomeninPreLawUW strives to create a space for women across all programs at the University of Waterloo to learn and support one another through their own unique journey of pre-law. Our vision is to bring together women from various majors and faculties who share this passion for law, whether they plan on going to law school, or simply find law interesting and want to become more immersed in learning and reflecting on women in this field. We commit to education on our platforms by reflecting on important inspirational figures and women empowerment. The club at its core allows an opportunity for women on campus to find like-minded individuals who share their passion for law, with a focus on women's empowerment and education overall!",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Women in Science, Technology, Engineering, and Mathematics (WiSTEM)",
        "overviews": "WiSTEM (Women in Science, Technology, Engineering, and Math) was founded in Spring 2013 by UW students who want to promote equality in STEM disciplines. Although we focus on the issue of gender imbalance, we encourage both males and females, grads and undergrads, and anyone with a connection to STEM to participate. Our activities are a mix of skills workshops, topical discussions, homework help, speakers, and special trips. We hope to deliver a regular programme of events spanning all STEM topics which promote collaboration, creativity, and open-mindedness to all students.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Young Liberals, UW",
        "overviews": "The Young Liberals of Canada is the organization for progressive, politically-minded youth. The University of Waterloo Young Liberals, exists to help students, faculty and citizens get informed and engaged in Canadian politics. Our mission is to inform and inspire the next generation of political leaders in the Kitchener-Waterloo region and across Canada, and connect Canadian youth with the political process. We strive to provide an inclusive environment where political opinions and ideas can be shared freely, and group members are given opportunities for active participation, personal growth, and leadership. We are affiliated with the Liberal Party of Canada, and believe in the liberal ideals of freedom, justice and equal opportunity for all Canadians.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "Yugioh Club",
        "overviews": "The UW Yu-Gi-Oh! Club is a place for current (and prospective) Yu-Gi-Oh! of all different skill levels to play, collect, and enjoy the card game as a whole.We plan on hosting tournaments (along with providing information about local game stores), for those that desire that competitive aspect as the game. We also have the resources in the form of training decks to teach the game from scratch to those who want to learn how to play. Additionally, we serve as an information and trading hub for all things Yu-Gi-Oh! TCG by providing new card information and discussions, rulings questions (with our in-house judges), and a mini trading forum.We aim to be a hub for the Yu-Gi-Oh! TCG, so come join our discord for more information:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [
                "https://discord.gg/UttpT6SS9X"
            ],
            "Email": []
        }
    },
    {
        "names": "oSTEM @ UWaterloo",
        "overviews": "oSTEM @ UWaterloo is the UWaterloo chapter of oSTEM, an international organization focused on LGBTQ+ people in STEM. We are a safe space for queer STEM students and allies to connect with peers and mentors and participate in events relating to queerness in STEM.Join us: \nContact us: \nDiscord: \n: \n: \nWebsite:",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [
                "https://www.facebook.com/OSTEM-at-UWaterloo-109543378533188/"
            ],
            "Instagram": [
                "https://www.instagram.com/ostem_uwaterloo/"
            ],
            "Twitter": [],
            "Website": [
                "https://forms.office.com/r/szeTBep3Bb",
                "ostem@clubs.wusa.ca",
                "https://discord.gg/Cg3R3rpKVQ",
                "https://ostem.clubs.wusa.ca/"
            ],
            "Email": []
        }
    },
    {
        "names": "osu! Club, UW",
        "overviews": "The purpose of the club is to provide an environment for members to discuss and play the rhythm game osu!. Tri-weekly meet-ups give members a place to play osu! in a multiplayer LAN setting or simply hang out, watch, and relax. Termly tournaments and contests give players and mappers of all types an opportunity to fuel their competitive spirit and test their abilities. We are a very welcoming community that encourages anybody interested in the game, regardless of skill level, to come check us out.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    },
    {
        "names": "uWaTNA",
        "overviews": "uWatna is a networking association promotes Tamil culture to the uWaterloo community. We will be hosting gatherings such as: networking opportunities, workshops, cultural and social events, and more. We want to be a medium for members to meet fellow individuals who are interested in the Tamil community.",
        "membership_type": "Club Membership is Free",
        "links": {
            "YouTube": [],
            "Facebook": [],
            "Instagram": [],
            "Twitter": [],
            "Website": [],
            "Email": []
        }
    }
]