{
    "club_name": "Artistic Swimming",
    "description": "Synchronized Swimming is a challenging sport that combines swimming, gymnastics, and dance. Competing in the Canadian University Synchronized Swimming league, Waterloo Warriors Synchronized Swimming Club is a team that has achieved great success. With athletes competing in several different routine events, including solos, duets and team competitions, there are many opportunities to explore the sport of synchronized swimming. If you are an experienced synchronized swimming athlete, we would love to welcome you to the team! Please contact us if you have any questions, for scheduling information or if you are interested in joining the team!",
    "join_today_link": "https://warrior.uwaterloo.ca/membership/GetMembershipSummary?membershipProductId=fa36b83d-f2bf-42b8-9cb9-706fbd3086c4",
    "try_it_sessions": [],
    "fee": "Approximately $170.00 per player. This fee is for each semester. *All clubs memberships require a prerequisite base athletics membership.  Currently enrolled, on-campus students already have this prerequisite membership during the Fall and Winter semesters.  For all other community participants and students attending classes in the summer months, a monthly base membership is required for purchase before enrolling into a club*",
    "executive_team": ["President & Finance:  Rachel Dietrich\nVice President - Experienced: Olivia Clay\nVice President - Novice: Elizabeth Nigh\nSocial Media: Leanne Schut\nTravel: Molly Chen"],
    "schedule": ["https://warrior.uwaterloo.ca/Program/GetProgramDetails?courseId=5d1f9ff9-c5cc-4b7a-943f-d8a05ebb3562"],
    "competitions": [],
    "contacts": [
        {
            "type": "EMAIL",
            "link": "mailto: artisticswimming@uwaterloo.ca"
        },
        {
            "type": "INSTAGRAM",
            "link": "https://www.instagram.com/wlooartisticswimming/"
        },
        {
            "type": "FACEBOOK",
            "link": "https://www.facebook.com/WarriorsSynchro/"
        }
    ],
    "coordinator_contact": "Karin Browne: karin.browne@uwaterloo.ca"
}